{
  "jan": [
    {
      "date": 1,
      "events": [
        {
          "title": "New Year's Day",
          "description": "New Year’s Day marks the beginning of the calendar year and is celebrated across the world as a time for renewal, hope, and fresh beginnings. It is rooted in the Gregorian calendar, which was adopted internationally for civil use. People often celebrate the day with family gatherings, cultural events, and public festivities. Many also use the occasion to reflect on the past year and set resolutions for personal or professional growth. Governments and organizations commonly observe it as a public holiday.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 3,
      "events": [
        {
          "title": "Hazarat Ali's Birthday",
          "description": "Hazarat Ali’s Birthday commemorates the birth of Ali ibn Abi Talib, the cousin and son-in-law of Prophet Muhammad and the first Imam in Shia Islam. He is revered for his wisdom, justice, courage, and deep commitment to ethical leadership. The day is observed through prayers, religious gatherings, and sermons highlighting his teachings and life values. Many believers also engage in acts of charity and community service to honor his legacy. {The date varies each year as it is observed according to the Islamic lunar calendar.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 4,
      "events": [
        {
          "title": "World Braille Day",
          "description": "World Braille Day celebrates the importance of Braille as a means of communication for people who are blind or visually impaired. It marks the birth anniversary of Louis Braille, who invented the Braille system in the 19th century. The day was officially recognized by the United Nations to promote awareness about accessibility and inclusion. Organizations use the occasion to advocate for equal rights and access to information. Educational programs and campaigns highlight the role of Braille in empowering visually impaired individuals.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 10,
      "events": [
        {
          "title": "World Hindi Day",
          "description": "World Hindi Day promotes the global use and appreciation of the Hindi language. It commemorates the first World Hindi Conference held to strengthen Hindi’s international presence. The day is supported by the Government of India and Indian diplomatic missions worldwide. Literary events, seminars, and cultural programs are organized to celebrate Hindi literature and heritage. It also aims to encourage learning and use of Hindi beyond national boundaries.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 12,
      "events": [
        {
          "title": "National Youth Day",
          "description": "National Youth Day is observed to honor the ideals and teachings of Swami Vivekananda and inspire young people. The day emphasizes the role of youth in nation-building and social transformation. It was declared by the Government of India to encourage character building, discipline, and leadership among young citizens. Educational institutions organize speeches, workshops, and volunteer activities. The day highlights the power of youth as drivers of positive change.",
          "category": "India"
        },
        {
          "title": "Swami Vivekananda Jayanti",
          "description": "Swami Vivekananda Jayanti commemorates the birth of Swami Vivekananda, a renowned Indian philosopher and spiritual leader. He played a key role in introducing Indian philosophies of Vedanta and Yoga to the Western world. His teachings focused on self-belief, service to humanity, and national pride. The day is observed through lectures, youth programs, and spiritual discussions. His message continues to inspire generations toward personal growth and social responsibility. {The date may vary as it is based on the Hindu calendar.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 13,
      "events": [
        {
          "title": "Lohri",
          "description": "Lohri is a popular winter harvest festival celebrated mainly in northern India. It marks the end of winter and the arrival of longer days after the solstice. The festival is deeply connected to agricultural traditions and seasonal change. People celebrate with bonfires, folk songs, dancing, and traditional foods. It holds special significance for newlyweds and newborns in families. {The date may vary slightly based on regional and traditional calendars.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 14,
      "events": [
        {
          "title": "Pongal",
          "description": "Pongal is a multi-day harvest festival celebrated primarily in Tamil Nadu. It is dedicated to the Sun God and expresses gratitude for agricultural abundance. The festival symbolizes prosperity, renewal, and harmony with nature. Families prepare the traditional dish “Pongal” and decorate homes with kolam designs. It also includes honoring cattle and farmers for their role in cultivation. {The date varies as it follows the Tamil solar calendar.}",
          "category": "India"
        },
        {
          "title": "Makar Sankranti",
          "description": "Makar Sankranti marks the transition of the Sun into the zodiac sign Capricorn. It signifies the end of the winter solstice and the start of longer days. The festival is associated with harvest celebrations across India under different regional names. People celebrate by flying kites, sharing sweets, and taking holy dips in rivers. It represents renewal, positivity, and seasonal change. {The date can vary slightly based on solar calculations.}",
          "category": "India"
        },
        {
          "title": "Magha Bihu",
          "description": "Magha Bihu, also known as Bhogali Bihu, is a major harvest festival of Assam. It celebrates the end of the harvesting season and abundance of food. The festival is marked by community feasts, bonfires, and traditional games. People express gratitude for prosperity and share meals with family and neighbors. It reflects unity, joy, and cultural heritage. {The date varies according to the Assamese calendar.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 15,
      "events": [
        {
          "title": "National Army Day",
          "description": "National Army Day honors the soldiers of the Indian Army and their service to the nation. It commemorates the day when the first Indian Commander-in-Chief took charge of the army. The occasion recognizes bravery, sacrifice, and discipline within the armed forces. Military parades and award ceremonies are held to mark the day. It strengthens public respect and appreciation for national defense personnel.",
          "category": "India"
        }
      ]
    },
    {
      "date": 16,
      "events": [
        {
          "title": "National Startup Day",
          "description": "National Startup Day celebrates innovation, entrepreneurship, and the startup ecosystem in India. It highlights the role of startups in economic growth and job creation. The day was established by the Government of India to encourage entrepreneurial culture. Events such as workshops, mentorship sessions, and startup showcases are organized nationwide. It aims to inspire young innovators and aspiring entrepreneurs.",
          "category": "India"
        }
      ]
    },
    {
      "date": 19,
      "events": [
        {
          "title": "Guru Govind Singh Jayanti",
          "description": "Guru Govind Singh Jayanti commemorates the birth of the tenth Sikh Guru, Guru Gobind Singh. He was a spiritual leader, poet, and warrior who founded the Khalsa. His teachings emphasized courage, equality, and devotion. Sikhs observe the day with prayers, processions, and community service. His legacy continues to shape Sikh identity and values. {The date varies as it is observed according to the Sikh and Hindu calendars.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 23,
      "events": [
        {
          "title": "Netaji Subhas Chandra Bose Jayanti",
          "description": "Netaji Subhas Chandra Bose Jayanti honors one of India’s most prominent freedom fighters. He played a crucial role in India’s struggle for independence and led the Indian National Army. The day remembers his patriotism, leadership, and revolutionary ideals. Tributes, cultural programs, and educational events are organized across the country. His life continues to inspire courage and national pride.",
          "category": "India"
        }
      ]
    },
    {
      "date": 24,
      "events": [
        {
          "title": "National Girl Child Day",
          "description": "National Girl Child Day promotes awareness about the rights, education, and welfare of girls. It highlights issues such as gender equality, child marriage, and access to education. The day was initiated by the Government of India to support empowerment of girls. Campaigns and programs encourage positive societal change. It aims to create a safer and more equal future for girls.",
          "category": "India"
        },
        {
          "title": "International Day of Education",
          "description": "International Day of Education highlights the importance of education in achieving peace and sustainable development. It was proclaimed by the United Nations to recognize education as a fundamental human right. The day draws attention to global challenges such as access to quality learning and lifelong education. Governments and institutions organize discussions, campaigns, and educational events. It emphasizes education’s role in reducing inequality and empowering societies.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 26,
      "events": [
        {
          "title": "Republic Day",
          "description": "Republic Day marks the day India adopted its Constitution and became a sovereign republic. It symbolizes democratic values, rule of law, and national unity. The day is celebrated with grand parades showcasing India’s cultural diversity and military strength. Citizens participate in flag-hoisting ceremonies and patriotic programs. It serves as a reminder of constitutional rights and responsibilities.",
          "category": "India"
        },
        {
          "title": "International Customs Day",
          "description": "International Customs Day recognizes the role of customs agencies in facilitating global trade and security. It commemorates the establishment of the World Customs Organization. The day highlights efforts to ensure safe, efficient, and lawful cross-border movement of goods. Customs departments organize awareness programs and professional events. It emphasizes cooperation between nations to combat smuggling and illegal trade.",
          "category": "Worldwide"
        },
        {
          "title": "International Day of Clean Energy",
          "description": "International Day of Clean Energy promotes the transition toward renewable and sustainable energy sources. It was established by the United Nations to support climate action and energy access for all. The day highlights the role of clean energy in reducing pollution and combating climate change. Governments and organizations promote innovation and awareness initiatives. It encourages global cooperation for a greener future.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 27,
      "events": [
        {
          "title": "International Day of Commemoration in Memory of the Victims of the Holocaust",
          "description": "This day honors the memory of millions of Jews and other victims killed during the Holocaust. It was designated by the United Nations to preserve historical truth and prevent future genocides. The day promotes education about the dangers of hatred, racism, and antisemitism. Memorial ceremonies and educational programs are held worldwide. It reinforces the commitment to human dignity and justice.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 28,
      "events": [
        {
          "title": "Data Protection Day",
          "description": "Data Protection Day raises awareness about privacy rights and protection of personal information. It highlights the growing importance of data security in the digital age. The day encourages responsible handling of personal data by organizations and governments. Campaigns focus on cybersecurity, consent, and digital rights. It empowers individuals to safeguard their online information.",
          "category": "Worldwide"
        }
      ]
    }
  ],
  "feb": [
    {
      "date": 1,
      "events": [
        {
          "title": "Guru Ravi Das's Birthday",
          "description": "Guru Ravi Das’s Birthday celebrates the birth of the revered saint and social reformer. He preached equality, compassion, and devotion beyond caste distinctions. His teachings emphasized spiritual unity and social justice. Devotees observe the day with prayers, hymns, and community service. His philosophy continues to inspire inclusive values. {The date varies each year as it is observed according to the Hindu calendar.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 2,
      "events": [
        {
          "title": "World Wetlands Day",
          "description": "World Wetlands Day raises awareness about the importance of wetlands for ecosystems and human survival. It marks the adoption of the Ramsar Convention on Wetlands. The day highlights wetlands’ role in biodiversity, water purification, and climate regulation. Environmental organizations conduct conservation campaigns and educational programs. It encourages sustainable use and protection of wetland habitats.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 4,
      "events": [
        {
          "title": "International Day of Human Fraternity",
          "description": "International Day of Human Fraternity promotes peace, tolerance, and coexistence among people of all cultures and religions. It was established by the United Nations to strengthen global unity. The day emphasizes dialogue, mutual respect, and shared human values. Events include interfaith discussions and cultural exchanges. It encourages building a more inclusive and harmonious world.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 6,
      "events": [
        {
          "title": "International Day of Zero Tolerance for Female Genital Mutilation",
          "description": "This day aims to eliminate female genital mutilation worldwide. It was established by the United Nations to protect the rights and health of women and girls. The day raises awareness about the physical and psychological harm caused by the practice. Advocacy programs support survivors and promote legal reforms. It reinforces global commitment to gender equality and human rights.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 10,
      "events": [
        {
          "title": "World Pulses Day [FAO]",
          "description": "World Pulses Day highlights the importance of pulses in nutrition and sustainable agriculture. It is promoted by the Food and Agriculture Organization to encourage healthy diets. Pulses play a vital role in food security and soil health. The day raises awareness about their environmental and economic benefits. It supports sustainable farming practices worldwide.",
          "category": "Worldwide"
        },
        {
          "title": "International Day of the Arabian Leopard",
          "description": "International Day of the Arabian Leopard focuses on conserving this critically endangered species. It highlights the importance of biodiversity and wildlife protection. The day promotes awareness about habitat loss and environmental threats. Conservation groups organize campaigns to protect natural ecosystems. It encourages international cooperation for wildlife preservation.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 11,
      "events": [
        {
          "title": "International Day of Women and Girls in Science",
          "description": "This day promotes equal access and participation of women and girls in science and technology. It was established by the United Nations to address gender disparities in STEM fields. The day highlights achievements of women scientists worldwide. Educational events encourage young girls to pursue scientific careers. It supports innovation through diversity and inclusion.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 12,
      "events": [
        {
          "title": "Swami Dayananda Saraswati Jayanti",
          "description": "Swami Dayananda Saraswati Jayanti commemorates the birth of the founder of the Arya Samaj. He advocated social reform, Vedic education, and rational thinking. His teachings opposed social evils and promoted equality. The day is observed with lectures, prayers, and educational programs. His ideas continue to influence reformist thought in India. {The date varies as it is based on the Hindu calendar.}",
          "category": "India"
        },
        {
          "title": "International Day for the Prevention of Violent Extremism as and when Conducive to Terrorism",
          "description": "This day highlights the need to address conditions that lead to violent extremism. It was proclaimed by the United Nations to promote peace and social resilience. The focus is on education, dialogue, and inclusive development. Governments and organizations work on prevention strategies and awareness programs. It emphasizes cooperation to counter radicalization and terrorism.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 13,
      "events": [
        {
          "title": "World Radio Day",
          "description": "World Radio Day celebrates radio as a powerful medium for communication, education, and cultural exchange. It was proclaimed by UNESCO to recognize radio’s role in reaching diverse and remote communities. The day highlights radio’s contribution to freedom of expression and access to information. Broadcasters organize special programs and discussions worldwide. It emphasizes radio’s relevance even in the digital age.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 15,
      "events": [
        {
          "title": "Maha Shivaratri",
          "description": "Maha Shivaratri is a major Hindu festival dedicated to Lord Shiva. It symbolizes spiritual awakening, self-discipline, and the victory of good over ignorance. Devotees observe fasting, night-long vigils, and special prayers at Shiva temples. The festival holds deep spiritual significance in Shaivism. It is believed to mark an auspicious cosmic event. {The date varies each year as it is based on the Hindu lunar calendar.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 17,
      "events": [
        {
          "title": "Global Tourism Resilience Day",
          "description": "Global Tourism Resilience Day highlights the need to strengthen the tourism sector against global crises. It was recognized by the United Nations to promote sustainable and resilient tourism practices. The day emphasizes preparedness, innovation, and recovery strategies. Governments and organizations discuss policies to protect livelihoods dependent on tourism. It supports long-term sustainability of the global travel industry.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 19,
      "events": [
        {
          "title": "Chhatrapati Shivaji Maharaj Jayanti",
          "description": "Chhatrapati Shivaji Maharaj Jayanti commemorates the birth of the founder of the Maratha Empire. He is remembered for his leadership, military strategy, and progressive governance. The day honors his contributions to Indian history and administration. Celebrations include processions, cultural programs, and historical discussions. His legacy continues to inspire ideals of justice and self-rule. {The date may vary as it is observed according to the Hindu calendar.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 20,
      "events": [
        {
          "title": "World Day of Social Justice",
          "description": "World Day of Social Justice promotes fairness, equality, and inclusion in societies worldwide. It was established by the United Nations to address issues like poverty, unemployment, and social exclusion. The day highlights the importance of human rights and decent work. Governments and organizations hold discussions and awareness campaigns. It encourages collective action toward equitable development.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 21,
      "events": [
        {
          "title": "International Mother Language Day",
          "description": "International Mother Language Day celebrates linguistic diversity and multilingual education. It was proclaimed by UNESCO to honor language rights and cultural identity. The day raises awareness about preserving endangered languages. Educational institutions promote linguistic inclusivity and cultural heritage. It emphasizes language as a foundation of communication and identity.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 22,
      "events": [
        {
          "title": "World Thinking Day",
          "description": "World Thinking Day is observed by Girl Guides and Girl Scouts worldwide. It promotes global friendship, leadership, and social awareness. The day encourages young people to think about world issues and community service. Activities focus on empowerment and unity across cultures. It reflects the values of responsibility and global citizenship.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 24,
      "events": [
        {
          "title": "Central Excise Day",
          "description": "Central Excise Day recognizes the role of excise authorities in revenue collection and economic regulation. It marks the implementation of India’s Central Excise law. The day highlights the contribution of tax administration to national development. Officials conduct seminars and awareness programs. It promotes transparency and efficiency in taxation systems.",
          "category": "India"
        }
      ]
    },
    {
      "date": 28,
      "events": [
        {
          "title": "National Science Day",
          "description": "National Science Day commemorates the discovery of the Raman Effect by Sir C. V. Raman. It celebrates scientific achievement and innovation in India. Educational institutions organize exhibitions, lectures, and science fairs. The day encourages scientific temper and research culture. It highlights science’s role in national progress.",
          "category": "India"
        }
      ]
    }
  ],
  "mar": [
    {
      "date": 1,
      "events": [
        {
          "title": "World Civil Defence Day",
          "description": "World Civil Defence Day emphasizes the importance of disaster preparedness and emergency response. It is observed to raise awareness about civil protection services. The day highlights the role of volunteers and authorities in saving lives. Training programs and drills are conducted worldwide. It promotes resilience against natural and man-made disasters.",
          "category": "Worldwide"
        },
        {
          "title": "Zero Discrimination Day [UNAIDS]",
          "description": "Zero Discrimination Day promotes equality and inclusion for all individuals. It is supported by UNAIDS to combat stigma, especially related to HIV/AIDS. The day encourages respect for human rights and diversity. Awareness campaigns focus on eliminating prejudice and inequality. It reinforces the message that discrimination harms societies.",
          "category": "Worldwide"
        },
        {
          "title": "World Seagrass Day",
          "description": "World Seagrass Day highlights the ecological importance of seagrass ecosystems. It raises awareness about their role in marine biodiversity and climate regulation. The day emphasizes conservation of coastal habitats. Environmental organizations promote sustainable marine practices. It supports global efforts to protect ocean life.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 3,
      "events": [
        {
          "title": "World Wildlife Day",
          "description": "World Wildlife Day celebrates the diversity of flora and fauna on Earth. It was proclaimed by the United Nations to raise awareness about wildlife conservation. The day highlights threats like habitat loss and illegal trade. Conservation activities and educational events are organized worldwide. It encourages protection of endangered species.",
          "category": "Worldwide"
        },
        {
          "title": "Dolyatra",
          "description": "Dolyatra is a traditional Hindu festival celebrated mainly in eastern India. It marks the arrival of spring and honors Lord Krishna. Devotees place idols on decorated swings and participate in cultural events. The festival is associated with joy and devotion. It is closely linked with seasonal change and tradition. {The date varies as it follows the Hindu calendar.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 4,
      "events": [
        {
          "title": "Holi",
          "description": "Holi is the vibrant festival of colors celebrated across India. It symbolizes the victory of good over evil and the arrival of spring. People celebrate by throwing colors, singing, and sharing sweets. The festival promotes unity, joy, and forgiveness. It is rooted in ancient Hindu traditions. {The date varies each year as it is based on the Hindu lunar calendar.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 5,
      "events": [
        {
          "title": "International Day for Disarmament and Non-Proliferation Awareness",
          "description": "This day raises awareness about the importance of disarmament and preventing the spread of weapons. It was established by the United Nations to educate people, especially youth, about global security risks. The observance highlights the humanitarian and environmental impacts of weapons. Discussions, campaigns, and educational events are organized worldwide. It encourages international cooperation for lasting peace.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 8,
      "events": [
        {
          "title": "International Women's Day",
          "description": "International Women’s Day celebrates the achievements of women across social, economic, cultural, and political fields. It originated from early 20th-century labor movements advocating for women’s rights. The day also raises awareness about gender equality and women’s empowerment. Events include campaigns, seminars, and community programs. It serves as a global call to action for equal opportunities.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 10,
      "events": [
        {
          "title": "International Day of Women Judges",
          "description": "This day recognizes the contributions of women judges to justice systems worldwide. It was proclaimed by the United Nations to promote gender equality in the judiciary. The observance highlights the importance of inclusive and representative legal institutions. Conferences and discussions are held to inspire women in law. It supports equal access to justice for all.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 15,
      "events": [
        {
          "title": "International Day to Combat Islamophobia",
          "description": "The International Day to Combat Islamophobia promotes tolerance, understanding, and respect for religious diversity. It was designated by the United Nations to address discrimination and hatred against Muslims. The day raises awareness about the harmful effects of prejudice and misinformation. Educational programs and dialogues encourage peaceful coexistence. It reinforces the values of human rights and dignity.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 19,
      "events": [
        {
          "title": "Chaitra Sukladi",
          "description": "Chaitra Sukladi marks the beginning of the Hindu lunar year in several regions of India. It signifies renewal, prosperity, and fresh beginnings. The day is observed with prayers, rituals, and cultural traditions. Many communities consider it an auspicious time to start new ventures. It reflects the seasonal transition into spring. {The date varies as it is based on the Hindu lunar calendar.}",
          "category": "India"
        },
        {
          "title": "Gudi Padava",
          "description": "Gudi Padava is the Marathi New Year celebrated mainly in Maharashtra. It symbolizes victory, prosperity, and new beginnings. Families raise a decorated gudi outside their homes and perform rituals. Traditional foods and cultural activities mark the celebration. The festival reflects regional heritage and optimism. {The date varies each year as it follows the Hindu lunar calendar.}",
          "category": "India"
        },
        {
          "title": "Ugadi",
          "description": "Ugadi marks the New Year in states such as Andhra Pradesh, Telangana, and Karnataka. It represents renewal, hope, and the cycle of time. People clean their homes, offer prayers, and prepare festive dishes like Ugadi pachadi. The festival blends spiritual reflection with celebration. It emphasizes balance in life’s experiences. {The date varies as it is based on the Hindu lunar calendar.}",
          "category": "India"
        },
        {
          "title": "Cheti Chand",
          "description": "Cheti Chand is celebrated as the New Year by the Sindhi community. It honors the birth of Jhulelal, a revered spiritual figure. Devotees participate in processions, prayers, and cultural programs. The festival promotes harmony and gratitude. It holds deep religious and cultural importance. {The date varies according to the Hindu calendar.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 20,
      "events": [
        {
          "title": "International Day of Happiness",
          "description": "The International Day of Happiness emphasizes the importance of happiness and well-being in human life. It was established by the United Nations to promote holistic development. The day highlights mental health, social connection, and positive living. People participate in activities that spread joy and kindness. It encourages policies that prioritize well-being.",
          "category": "Worldwide"
        },
        {
          "title": "French Language Day",
          "description": "French Language Day celebrates the French language and its cultural influence worldwide. It is observed to promote multilingualism and cultural diversity. The day highlights the role of French in diplomacy and education. Events include language workshops and cultural programs. It strengthens appreciation for linguistic heritage.",
          "category": "Worldwide"
        },
        {
          "title": "Jamat- Ul- Vida (Expected)",
          "description": "Jamat-Ul-Vida is observed on the last Friday of the holy month of Ramadan. It holds great spiritual significance for Muslims. Devotees gather for special prayers and sermons at mosques. The day emphasizes reflection, devotion, and community unity. It is considered one of the most sacred Fridays. {The date varies each year as it depends on the Islamic lunar calendar and moon sighting.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 21,
      "events": [
        {
          "title": "International Day for the Elimination of Racial Discrimination",
          "description": "This day raises awareness about the need to end racial discrimination worldwide. It was proclaimed by the United Nations in remembrance of victims of racial injustice. The observance promotes equality, dignity, and human rights. Educational events and campaigns highlight inclusion and justice. It encourages societies to reject racism in all forms.",
          "category": "Worldwide"
        },
        {
          "title": "World Poetry Day",
          "description": "World Poetry Day celebrates poetry as a form of artistic and cultural expression. It was established by UNESCO to support linguistic diversity and creativity. The day encourages reading, writing, and sharing poetry. Literary events and workshops are organized globally. It honors poets and their contributions to culture.",
          "category": "Worldwide"
        },
        {
          "title": "International Day of Nowruz",
          "description": "International Day of Nowruz celebrates the Persian New Year and the arrival of spring. It represents renewal, peace, and harmony with nature. The festival is observed with traditional rituals, meals, and cultural gatherings. It is recognized by the United Nations as an intangible cultural heritage. It strengthens bonds across communities. {The date may vary slightly depending on astronomical calculations of the vernal equinox.}",
          "category": "Worldwide"
        },
        {
          "title": "World Down Syndrome Day",
          "description": "World Down Syndrome Day raises awareness about Down syndrome and inclusion. It highlights the abilities and rights of people with Down syndrome. The day promotes acceptance, support, and equal opportunities. Awareness campaigns and community events are organized worldwide. It encourages respect and understanding in society.",
          "category": "Worldwide"
        },
        {
          "title": "World Day for Glaciers",
          "description": "World Day for Glaciers highlights the critical role glaciers play in regulating the Earth’s climate and freshwater supply. It was established to raise awareness about the rapid melting of glaciers due to climate change. The day emphasizes the environmental and social impacts on ecosystems and communities. Scientific discussions and awareness campaigns are organized globally. It encourages climate action and sustainable environmental practices.",
          "category": "Worldwide"
        },
        {
          "title": "International Day of Forests",
          "description": "The International Day of Forests celebrates the importance of forests for life on Earth. It was proclaimed by the United Nations to promote forest conservation and sustainable management. The day highlights forests’ role in biodiversity, climate regulation, and livelihoods. Tree-planting drives and educational programs are commonly held. It encourages protecting forests for future generations.",
          "category": "Worldwide"
        },
        {
          "title": "Id-ul-Fitr (Expected)",
          "description": "Id-ul-Fitr marks the end of the holy month of Ramadan and celebrates spiritual renewal. It is observed by Muslims worldwide with prayers, charity, and festive gatherings. The day emphasizes gratitude, compassion, and community bonding. Special prayers are held at mosques, followed by sharing meals with family and the needy. It is one of the most important Islamic festivals. {The date varies each year based on the Islamic lunar calendar and moon sighting.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 22,
      "events": [
        {
          "title": "World Water Day",
          "description": "World Water Day focuses on the importance of freshwater and sustainable water management. It was initiated by the United Nations to address global water challenges. The day raises awareness about water scarcity, sanitation, and conservation. Campaigns and discussions are held worldwide. It promotes responsible use of water resources.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 23,
      "events": [
        {
          "title": "World Meteorological Day",
          "description": "World Meteorological Day commemorates the establishment of the World Meteorological Organization. It highlights the importance of weather, climate, and water-related sciences. The day focuses on improving forecasting and disaster preparedness. Educational programs and public awareness campaigns are organized. It emphasizes the role of meteorology in protecting lives and property.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 24,
      "events": [
        {
          "title": "World Tuberculosis Day",
          "description": "World Tuberculosis Day raises awareness about tuberculosis and efforts to eliminate it. It marks the discovery of the TB-causing bacterium by Dr. Robert Koch. The day highlights prevention, diagnosis, and treatment initiatives. Health campaigns and screenings are conducted globally. It aims to accelerate progress toward ending TB.",
          "category": "Worldwide"
        },
        {
          "title": "International Day for the Right to the Truth concerning Gross Human Rights Violations and for the Dignity of Victims",
          "description": "This day honors victims of gross human rights violations and promotes truth and justice. It was established by the United Nations to recognize the importance of accountability. The observance highlights the right of victims to know the truth. Memorial events and discussions are organized worldwide. It reinforces respect for human dignity and justice.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 25,
      "events": [
        {
          "title": "International Day of Remembrance of the Victims of Slavery and the Transatlantic Slave Trade",
          "description": "This day commemorates the victims of slavery and the transatlantic slave trade. It was proclaimed by the United Nations to educate people about this historical injustice. The observance promotes remembrance, reflection, and awareness. Educational programs and memorial events are held globally. It encourages efforts against racism and discrimination.",
          "category": "Worldwide"
        },
        {
          "title": "International Day of Solidarity with Detained and Missing Staff Members",
          "description": "This day honors UN staff and associated personnel who are detained or missing while serving. It highlights the risks faced by humanitarian workers worldwide. The observance raises awareness about their safety and rights. Events focus on advocacy and remembrance. It calls for protection and accountability.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 27,
      "events": [
        {
          "title": "World Theatre Day",
          "description": "World Theatre Day celebrates theatre as a form of artistic and cultural expression. It was initiated by the International Theatre Institute to promote performing arts. The day highlights theatre’s role in storytelling and social reflection. Performances and workshops are organized worldwide. It honors artists and creative communities.",
          "category": "Worldwide"
        },
        {
          "title": "Ram Navami",
          "description": "Ram Navami celebrates the birth of Lord Rama, a major deity in Hinduism. It symbolizes righteousness, devotion, and moral values. Devotees observe the day with prayers, fasting, and religious gatherings. Temples organize special rituals and readings from scriptures. The festival holds deep spiritual significance. {The date varies each year as it is based on the Hindu lunar calendar.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 30,
      "events": [
        {
          "title": "International Day of Zero Waste",
          "description": "The International Day of Zero Waste promotes sustainable consumption and waste reduction. It was established by the United Nations to address environmental challenges caused by waste. The day emphasizes recycling, reuse, and responsible production. Awareness campaigns and community initiatives are organized. It supports a circular economy and environmental protection.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 31,
      "events": [
        {
          "title": "Mahavir Jayanti",
          "description": "Mahavir Jayanti celebrates the birth of Lord Mahavira, the founder of Jainism. It emphasizes principles such as non-violence, truth, and compassion. Devotees participate in prayers, processions, and charitable acts. Temples organize special sermons and rituals. The day promotes peace and ethical living. {The date varies as it follows the Jain lunar calendar.}",
          "category": "India"
        }
      ]
    }
  ],
  "apr": [
    {
      "date": 1,
      "events": [
        {
          "title": "April Fools Day",
          "description": "April Fools’ Day is observed as a day of humor and light-hearted pranks. It is celebrated in many countries around the world. People play harmless jokes and practical pranks on friends and family. Media and social platforms often participate playfully. The day promotes laughter and amusement.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 2,
      "events": [
        {
          "title": "World Autism Awareness Day",
          "description": "World Autism Awareness Day promotes understanding and acceptance of autism spectrum disorder. It was designated by the United Nations to highlight inclusion and support. The day focuses on the abilities and rights of individuals with autism. Awareness campaigns and community programs are organized globally. It encourages building an inclusive society.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 3,
      "events": [
        {
          "title": "Good Friday",
          "description": "Good Friday commemorates the crucifixion of Jesus Christ and his sacrifice for humanity. It is one of the most solemn days in Christianity, observed during Holy Week. Churches hold prayer services, scripture readings, and moments of silence. Many believers fast and reflect on themes of sacrifice, forgiveness, and redemption. The day holds deep religious and spiritual significance. {The date varies each year as it is observed on the Friday before Easter, based on the Christian liturgical calendar.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 4,
      "events": [
        {
          "title": "International Day for Mine Awareness and Assistance in Mine Action",
          "description": "This day raises awareness about the dangers of landmines and explosive remnants of war. It was established by the United Nations to support mine clearance and victim assistance efforts. The observance highlights the humanitarian impact of mines on civilians. Awareness campaigns and policy discussions are held globally. It promotes international cooperation to achieve mine-free communities.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 5,
      "events": [
        {
          "title": "International Day of Conscience",
          "description": "The International Day of Conscience promotes peace, tolerance, and mutual respect among individuals and nations. It was proclaimed by the United Nations to encourage ethical reflection and dialogue. The day emphasizes moral responsibility in addressing global challenges. Educational and awareness programs are organized worldwide. It encourages peaceful coexistence and harmony.",
          "category": "Worldwide"
        },
        {
          "title": "Easter Sunday",
          "description": "Easter Sunday celebrates the resurrection of Jesus Christ from the dead. It is the most important festival in Christianity, symbolizing hope and new life. Churches conduct special services, prayers, and celebrations. Families gather to share festive meals and traditions. The day represents victory over sin and death. {The date varies each year as it is determined by the lunar-based Christian calendar.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 6,
      "events": [
        {
          "title": "International Day of Sport for Development and Peace",
          "description": "This day highlights the role of sport in promoting peace, development, and social inclusion. It was declared by the United Nations to recognize sport as a tool for positive change. The observance emphasizes teamwork, equality, and fair play. Sporting events and awareness programs are organized globally. It encourages using sport to bridge social divides.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 7,
      "events": [
        {
          "title": "World Health Day",
          "description": "World Health Day marks the founding of the World Health Organization. It focuses on raising awareness about global health issues and public well-being. Each year highlights a specific health theme of international importance. Health campaigns and outreach programs are conducted worldwide. The day promotes access to quality healthcare for all.",
          "category": "Worldwide"
        },
        {
          "title": "International Day of Reflection on the 1994 Genocide against the Tutsi in Rwanda",
          "description": "This day commemorates the victims of the 1994 genocide against the Tutsi in Rwanda. It was established by the United Nations to honor the memory of those who lost their lives. The observance promotes remembrance, reflection, and education. Memorial events and discussions are held globally. It reinforces the importance of preventing genocide and hatred.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 12,
      "events": [
        {
          "title": "International Day of Human Space Flight",
          "description": "The International Day of Human Space Flight celebrates humanity’s achievements in space exploration. It marks the anniversary of the first human spaceflight by Yuri Gagarin. The day highlights scientific progress and international cooperation in space. Educational programs and exhibitions are organized worldwide. It inspires future generations in science and exploration.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 14,
      "events": [
        {
          "title": "World Chagas Disease Day",
          "description": "World Chagas Disease Day raises awareness about Chagas disease and its impact on global health. It highlights the need for early diagnosis, treatment, and prevention. The observance focuses on communities affected by neglected tropical diseases. Health awareness campaigns are conducted worldwide. It aims to improve access to healthcare and reduce disease burden.",
          "category": "Worldwide"
        },
        {
          "title": "Vaisakhi",
          "description": "Vaisakhi marks the harvest festival and the formation of the Khalsa in Sikhism. It holds great religious and cultural importance for Sikhs and farming communities. Devotees visit gurdwaras, participate in prayers, and join processions. Cultural celebrations and community meals are common. The festival symbolizes renewal and unity. {The date varies slightly as it is based on the solar calendar.}",
          "category": "India"
        },
        {
          "title": "Vishu",
          "description": "Vishu marks the Malayalam New Year and symbolizes new beginnings. It is celebrated primarily in Kerala with traditional rituals. The Vishukkani arrangement is viewed as the first sight of the year. Families exchange gifts and enjoy festive meals. The festival represents prosperity and hope. {The date varies as it follows the regional solar calendar.}",
          "category": "India"
        },
        {
          "title": "Meshadi",
          "description": "Meshadi signifies the beginning of the solar New Year in several Indian traditions. It marks the Sun’s transition into the Aries zodiac sign. The day is associated with renewal and auspicious beginnings. People observe rituals and cultural customs. It reflects seasonal and agricultural cycles. {The date varies as it is determined by the solar calendar.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 15,
      "events": [
        {
          "title": "World Art Day",
          "description": "World Art Day celebrates creativity and artistic expression across cultures. It was established to promote awareness of the arts and their contribution to society. The day honors artists and encourages creative freedom. Exhibitions, workshops, and cultural programs are organized worldwide. It highlights art’s role in fostering dialogue and innovation.",
          "category": "Worldwide"
        },
        {
          "title": "Vaisakhadi (Bengal)",
          "description": "Vaisakhadi marks the Bengali New Year and symbolizes renewal and prosperity. It is celebrated with traditional music, cultural programs, and festive meals. People wear traditional attire and exchange greetings. The day reflects cultural identity and heritage. It welcomes a fresh start for individuals and communities. {The date varies as it follows the Bengali solar calendar.}",
          "category": "India"
        },
        {
          "title": "Bohag Bihu (Assam)",
          "description": "Bohag Bihu marks the Assamese New Year and the beginning of the harvest season. It is the most important festival in Assam, celebrating nature and renewal. Traditional dances, music, and community feasts are central to the celebrations. The festival strengthens social bonds and cultural pride. It symbolizes joy, prosperity, and new beginnings. {The date varies as it is based on the regional solar calendar.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 20,
      "events": [
        {
          "title": "Chinese Language Day",
          "description": "Chinese Language Day celebrates the Chinese language and its cultural significance worldwide. It was established by the United Nations to promote multilingualism and cultural diversity. The day highlights the history and influence of the Chinese script and literature. Educational events, language workshops, and cultural programs are organized globally. It encourages appreciation of linguistic heritage.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 21,
      "events": [
        {
          "title": "World Creativity and Innovation Day",
          "description": "World Creativity and Innovation Day recognizes creativity as a key driver of development and problem-solving. It was designated by the United Nations to encourage innovative thinking across societies. The observance highlights creativity in science, arts, education, and entrepreneurship. Workshops, exhibitions, and innovation challenges are organized worldwide. It promotes sustainable solutions through creative ideas.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 22,
      "events": [
        {
          "title": "International Mother Earth Day",
          "description": "International Mother Earth Day emphasizes the interconnectedness between humans and nature. It was established by the United Nations to promote environmental protection and sustainability. The day raises awareness about climate change and ecological balance. Environmental campaigns and tree-planting activities are common. It encourages responsible stewardship of the planet.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 23,
      "events": [
        {
          "title": "International Girls in ICT Day [ITU]",
          "description": "This day promotes the participation of girls and women in information and communication technologies. It was initiated by the International Telecommunication Union to bridge the gender digital divide. The observance highlights career opportunities in STEM fields. Mentorship programs, workshops, and awareness campaigns are held globally. It aims to empower young women through technology. {The date varies as it is observed on the fourth Thursday of April each year.}",
          "category": "Worldwide"
        },
        {
          "title": "World Book and Copyright Day [UNESCO]",
          "description": "World Book and Copyright Day celebrates books, reading, and intellectual property rights. It was established by UNESCO to promote literacy and protect authors’ works. The day highlights the importance of reading for education and cultural exchange. Book fairs, readings, and literary events are organized worldwide. It encourages lifelong learning through books.",
          "category": "Worldwide"
        },
        {
          "title": "English Language Day",
          "description": "English Language Day celebrates the English language and its global role in communication. It was established by the United Nations to promote multilingualism. The day highlights the literary and cultural contributions of the language. Educational and cultural events are organized worldwide. It encourages respect for linguistic diversity.",
          "category": "Worldwide"
        },
        {
          "title": "Spanish Language Day",
          "description": "Spanish Language Day honors the Spanish language and its cultural heritage. It was proclaimed by the United Nations to promote linguistic diversity. The observance highlights Spanish literature, history, and global influence. Cultural programs and language events are held internationally. It encourages cross-cultural understanding.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 24,
      "events": [
        {
          "title": "International Day of Multilateralism and Diplomacy for Peace",
          "description": "This day highlights the importance of multilateral cooperation in maintaining global peace. It was established by the United Nations to promote dialogue and collective action. The observance emphasizes diplomacy as a tool for conflict resolution. Discussions and policy events are held worldwide. It encourages international solidarity and cooperation.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 25,
      "events": [
        {
          "title": "World Malaria Day",
          "description": "World Malaria Day raises awareness about malaria prevention and control. It was established by the World Health Organization to support global elimination efforts. The day highlights progress and remaining challenges in combating the disease. Health campaigns and community outreach programs are organized worldwide. It promotes access to treatment and prevention.",
          "category": "Worldwide"
        },
        {
          "title": "International Delegate's Day",
          "description": "International Delegate’s Day recognizes the role of delegates in diplomacy and international cooperation. It commemorates the first meeting of the United Nations General Assembly. The observance highlights the importance of representation and dialogue. Educational programs and discussions are organized globally. It emphasizes peaceful international relations.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 26,
      "events": [
        {
          "title": "World Intellectual Property Day",
          "description": "World Intellectual Property Day highlights the role of intellectual property in encouraging innovation and creativity. It was established by the World Intellectual Property Organization. The day raises awareness about patents, copyrights, and trademarks. Seminars and awareness campaigns are held worldwide. It promotes respect for creators’ rights.",
          "category": "Worldwide"
        },
        {
          "title": "International Chernobyl Disaster Remembrance Day",
          "description": "This day commemorates the victims of the Chernobyl nuclear disaster. It was established by the United Nations to remember the long-term impacts of the tragedy. The observance highlights nuclear safety and disaster preparedness. Memorial events and educational programs are organized globally. It promotes awareness of environmental and health risks.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 28,
      "events": [
        {
          "title": "World Day for Safety and Health at Work",
          "description": "World Day for Safety and Health at Work promotes safe and healthy working conditions. It was initiated by the International Labour Organization to prevent workplace accidents. The observance highlights occupational safety standards. Awareness campaigns and training programs are held worldwide. It encourages protection of workers’ rights.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 30,
      "events": [
        {
          "title": "International Jazz Day",
          "description": "International Jazz Day celebrates jazz music and its role in promoting peace and unity. It was established by UNESCO to recognize jazz as a cultural bridge. The day highlights freedom of expression and creativity. Concerts and educational programs are organized globally. It encourages cultural dialogue through music.",
          "category": "Worldwide"
        }
      ]
    }
  ],
  "may": [
    {
      "date": 1,
      "events": [
        {
          "title": "Budha Purnima",
          "description": "Budha Purnima commemorates the birth, enlightenment, and death of Gautama Buddha. It is one of the most sacred festivals in Buddhism. Devotees visit temples, meditate, and participate in prayer ceremonies. Acts of charity and peace teachings are emphasized. The day symbolizes compassion, wisdom, and enlightenment. {The date varies as it is observed according to the lunar calendar.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 2,
      "events": [
        {
          "title": "World Tuna Day",
          "description": "World Tuna Day highlights the importance of tuna conservation and sustainable fishing practices. It was established by the United Nations to raise awareness about overfishing and marine ecosystem balance. The day emphasizes the role of tuna in global food security and livelihoods. Educational campaigns and marine conservation programs are conducted worldwide. It promotes responsible consumption and protection of ocean resources.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 3,
      "events": [
        {
          "title": "World Press Freedom Day",
          "description": "World Press Freedom Day celebrates the fundamental principles of press freedom. It was proclaimed by the United Nations to support free, independent, and pluralistic media. The day honors journalists who risk their lives for truth and transparency. Discussions, awards, and awareness campaigns are organized globally. It emphasizes the role of media in democracy and accountability.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 5,
      "events": [
        {
          "title": "World Portugese Language Day",
          "description": "World Portuguese Language Day celebrates the Portuguese language and Lusophone cultures worldwide. It was established by UNESCO to promote linguistic diversity and cultural heritage. The observance highlights literature, history, and shared cultural identity. Cultural events and language programs are held internationally. It strengthens ties among Portuguese-speaking communities.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 8,
      "events": [
        {
          "title": "Time of Remembrance and Reconciliation for Those Who Lost Their Lives During the Second World War",
          "description": "This observance honors the victims of the Second World War. It was established by the United Nations to promote remembrance and reconciliation. The day reflects on the human cost of war and the importance of peace. Memorial ceremonies and educational programs are held worldwide. It encourages future generations to uphold peace and unity.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 9,
      "events": [
        {
          "title": "Birthday of Guru Rabindranath Tagore",
          "description": "This day commemorates the birth of Rabindranath Tagore, a Nobel Prize–winning poet and philosopher. He made significant contributions to literature, education, and cultural thought. The day is observed through literary programs, music, and cultural events. Educational institutions honor his works and teachings. It celebrates creativity, humanism, and cultural unity. {The date varies as it is observed according to the Bengali calendar.}",
          "category": "India"
        },
        {
          "title": "World Migratory Bird Day [UNEP]",
          "description": "This day raises awareness about the conservation of migratory birds and their habitats. It highlights threats such as climate change and habitat loss. The observance promotes international cooperation for wildlife protection. Nature walks and educational programs are organized. {The date varies as it is observed on the second Saturday of October.}",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 10,
      "events": [
        {
          "title": "International Day of Argania",
          "description": "International Day of Argania highlights the importance of the argan tree and its ecosystem. It was proclaimed by the United Nations to promote sustainable development and biodiversity. The day emphasizes the role of argan forests in local livelihoods, especially for women. Educational and environmental activities are organized globally. It supports conservation and sustainable use of natural resources.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 12,
      "events": [
        {
          "title": "Vesak, the Day of the Full Moon",
          "description": "Vesak commemorates the birth, enlightenment, and passing of Lord Buddha. It is one of the most sacred festivals for Buddhists worldwide. Devotees participate in prayers, meditation, and acts of charity. Temples are decorated and community service activities are encouraged. The day symbolizes peace, compassion, and spiritual reflection. {The date varies as it is observed on the full moon of the lunar calendar.}",
          "category": "Worldwide"
        },
        {
          "title": "International Day of Plant Health [FAO]",
          "description": "International Day of Plant Health raises awareness about protecting plants from pests and diseases. It was established by the United Nations and coordinated by FAO. The day highlights the role of plant health in food security and ecosystems. Educational campaigns and agricultural outreach programs are organized worldwide. It promotes sustainable farming and biodiversity protection.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 15,
      "events": [
        {
          "title": "International Day of Families",
          "description": "International Day of Families highlights the importance of families as fundamental units of society. It was proclaimed by the United Nations to address social, economic, and demographic issues affecting families. The day encourages awareness of family-related challenges. Community programs and discussions are organized globally. It promotes inclusive and supportive family policies.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 16,
      "events": [
        {
          "title": "International Day of Light",
          "description": "International Day of Light celebrates the role of light-based technologies in science and culture. It was established by UNESCO to highlight advances in optics and photonics. The observance promotes education and scientific cooperation. Lectures, exhibitions, and outreach programs are held worldwide. It emphasizes light’s role in sustainable development.",
          "category": "Worldwide"
        },
        {
          "title": "International Day of Living Together in Peace",
          "description": "This day promotes peace, tolerance, and coexistence among cultures and communities. It was established by the United Nations to encourage dialogue and solidarity. The observance highlights respect for diversity and mutual understanding. Educational and cultural programs are organized globally. It supports harmony and social cohesion.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 17,
      "events": [
        {
          "title": "World Telecommunication and Information Society Day",
          "description": "World Telecommunication and Information Society Day highlights the role of digital technologies in development. It was established by the International Telecommunication Union. The day raises awareness about bridging the digital divide. Conferences and technology-focused events are organized worldwide. It promotes inclusive access to information and communication technologies.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 19,
      "events": [
        {
          "title": "World Fair Play Day",
          "description": "World Fair Play Day celebrates fairness, integrity, and respect in sports and society. It promotes ethical behavior and mutual respect through athletic values. The observance highlights sportsmanship as a universal principle. Educational and sports-related events are organized globally. It encourages honesty and respect both on and off the field.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 20,
      "events": [
        {
          "title": "World Bee Day [FAO]",
          "description": "World Bee Day raises awareness about the importance of bees and pollinators. It was established by the United Nations and supported by FAO to protect biodiversity. The day highlights threats faced by pollinators due to environmental changes. Conservation campaigns and educational programs are organized worldwide. It promotes sustainable agriculture and ecosystem health.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 21,
      "events": [
        {
          "title": "International Tea Day",
          "description": "International Tea Day celebrates the cultural, economic, and social importance of tea worldwide. It was proclaimed by the United Nations to support tea workers and sustainable production. The day highlights tea’s role in livelihoods, especially in developing countries. Cultural programs, exhibitions, and awareness campaigns are held globally. It promotes fair trade and responsible consumption.",
          "category": "Worldwide"
        },
        {
          "title": "World Day for Cultural Diversity for Dialogue and Development",
          "description": "This day celebrates cultural diversity as a driver of peace and development. It was established by UNESCO to promote intercultural dialogue and mutual understanding. The observance highlights the value of cultural expressions and traditions. Cultural events, discussions, and educational programs are organized worldwide. It encourages respect, inclusion, and global cooperation.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 22,
      "events": [
        {
          "title": "International Day for Biological Diversity",
          "description": "International Day for Biological Diversity raises awareness about the importance of biodiversity. It commemorates the adoption of the Convention on Biological Diversity by the United Nations. The day highlights threats to ecosystems and species. Conservation programs and educational activities are conducted globally. It promotes sustainable use of natural resources.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 23,
      "events": [
        {
          "title": "International Day to End Obstetric Fistula",
          "description": "This day focuses on ending obstetric fistula, a preventable childbirth injury. It was established by the United Nations to promote maternal healthcare access. The observance highlights the importance of skilled birth attendance. Awareness campaigns and healthcare initiatives are organized worldwide. It supports dignity and health for women and girls.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 24,
      "events": [
        {
          "title": "International Day of the Markhor",
          "description": "International Day of the Markhor celebrates the conservation of the markhor, a rare mountain goat species. It was proclaimed by the United Nations to highlight wildlife protection efforts. The day emphasizes biodiversity conservation and sustainable ecosystems. Awareness programs and conservation initiatives are promoted. It supports international cooperation in wildlife protection.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 25,
      "events": [
        {
          "title": "World Football Day",
          "description": "World Football Day celebrates football as a unifying global sport. It highlights the role of football in promoting teamwork, inclusion, and peace. The day encourages sports participation across communities. Friendly matches and sports events are organized worldwide. It emphasizes the positive social impact of sports.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 27,
      "events": [
        {
          "title": "Id-ul-Zuha (Bakrid)",
          "description": "Id-ul-Zuha, also known as Bakrid, commemorates the spirit of sacrifice shown by Prophet Ibrahim. It is one of the most important Islamic festivals. The day is observed through prayers, charity, and sharing meals. It emphasizes compassion, faith, and community bonding. {The date varies as it is observed according to the Islamic lunar calendar.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 29,
      "events": [
        {
          "title": "International Day of UN Peacekeepers",
          "description": "This day honors the service and sacrifice of United Nations peacekeepers. It commemorates the first UN peacekeeping mission. The observance recognizes their role in maintaining global peace and security. Ceremonies and tributes are held worldwide. It also honors those who lost their lives in service.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 30,
      "events": [
        {
          "title": "International Day of Potato [FAO]",
          "description": "International Day of Potato highlights the importance of potatoes in food security and nutrition. It was established by the United Nations and supported by FAO. The day emphasizes sustainable agriculture and rural development. Awareness campaigns and agricultural programs are organized globally. It promotes appreciation of this vital crop.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 31,
      "events": [
        {
          "title": "World No-Tobacco Day [WHO]",
          "description": "World No-Tobacco Day raises awareness about the harmful effects of tobacco use. It was established by the World Health Organization to promote tobacco control. The day highlights public health risks and prevention strategies. Health campaigns and policy discussions are conducted worldwide. It encourages healthier lifestyles and tobacco-free environments.",
          "category": "Worldwide"
        }
      ]
    }
  ],
  "jun": [
    {
      "date": 1,
      "events": [
        {
          "title": "Global Day of Parents",
          "description": "Global Day of Parents recognizes the role of parents in nurturing children. It was proclaimed by the United Nations to honor parental commitment. The day highlights the importance of family values and child development. Awareness programs and family-centered activities are organized globally. It promotes responsible parenting and family well-being.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 3,
      "events": [
        {
          "title": "World Bicycle Day",
          "description": "World Bicycle Day celebrates cycling as a sustainable and healthy mode of transport. It was established by the United Nations to promote environmental and health benefits. The observance highlights accessibility and eco-friendly mobility. Cycling events and awareness campaigns are organized worldwide. It supports sustainable urban development.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 4,
      "events": [
        {
          "title": "International Day of Innocent Children Victims of Aggression",
          "description": "This day highlights the suffering of children affected by conflict and violence. It was established by the United Nations to protect children’s rights. The observance raises awareness about child abuse and trauma. Educational and advocacy programs are conducted globally. It promotes peace and child protection.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 5,
      "events": [
        {
          "title": "World Environment Day",
          "description": "World Environment Day encourages global awareness and action for environmental protection. It was established by the United Nations Environment Programme. Each year focuses on a specific environmental theme. Clean-up drives and awareness campaigns are organized worldwide. It promotes sustainability and environmental responsibility.",
          "category": "Worldwide"
        },
        {
          "title": "International Day for the Fight against Illegal, Unreported and Unregulated Fishing",
          "description": "This day highlights the threat of illegal fishing to marine ecosystems. It was proclaimed by the United Nations to promote sustainable fisheries. The observance emphasizes ocean conservation and food security. Awareness campaigns and policy discussions are held globally. It supports responsible and legal fishing practices.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 6,
      "events": [
        {
          "title": "Russian Language Day",
          "description": "Russian Language Day celebrates the Russian language, its rich literary heritage, and cultural significance. It was established by UNESCO to promote multilingualism and cultural diversity. The observance highlights Russian literature, poetry, and arts. Cultural programs, literary readings, and language workshops are organized worldwide. It encourages appreciation of the Russian language and its contributions to global communication.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 7,
      "events": [
        {
          "title": "World Food Safety Day",
          "description": "World Food Safety Day raises awareness about the importance of safe food for health. It was established by the United Nations to prevent foodborne illnesses. The day highlights best practices in food production, handling, and consumption. Awareness campaigns, workshops, and policy initiatives are organized globally. It emphasizes the role of governments, businesses, and consumers in ensuring food safety.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 8,
      "events": [
        {
          "title": "World Oceans Day",
          "description": "World Oceans Day celebrates the importance of oceans for life on Earth. It was established by the United Nations to promote conservation and sustainable use of marine resources. The day highlights issues like pollution, overfishing, and climate change. Activities include beach clean-ups, educational programs, and awareness campaigns. It encourages global efforts to protect marine ecosystems and biodiversity.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 10,
      "events": [
        {
          "title": "International Day for Dialogue among Civilizations",
          "description": "This day promotes dialogue and understanding between different civilizations and cultures. It was established by the United Nations to encourage peace and tolerance. The observance highlights the importance of intercultural communication. Cultural events, conferences, and educational programs are organized worldwide. It fosters respect, cooperation, and global harmony.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 11,
      "events": [
        {
          "title": "International Day of Play",
          "description": "The International Day of Play celebrates the importance of play in child development and well-being. It was established to highlight physical, cognitive, and social benefits of play. Activities include community games, playground events, and educational programs. The day encourages children, families, and schools to prioritize playful learning. It promotes creativity, health, and social interaction.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 12,
      "events": [
        {
          "title": "World Day Against Child Labour",
          "description": "This day highlights the plight of children involved in exploitative labor. It was established by the International Labour Organization to eliminate child labor worldwide. The observance raises awareness about laws, education, and advocacy for children’s rights. Campaigns, workshops, and social initiatives are organized globally. It promotes education, protection, and safe childhoods.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 13,
      "events": [
        {
          "title": "International Albinism Awareness Day",
          "description": "This day raises awareness about the challenges faced by people with albinism. It was established by the United Nations to combat discrimination and violence. The observance highlights human rights, education, and healthcare needs. Awareness campaigns, educational activities, and advocacy programs are organized worldwide. It promotes inclusion, protection, and equality for people with albinism.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 14,
      "events": [
        {
          "title": "World Blood Donor Day [WHO]",
          "description": "World Blood Donor Day celebrates voluntary blood donors and raises awareness about the need for safe blood. It was established by the World Health Organization to save lives through blood donation. The observance emphasizes regular donations and safe transfusion practices. Campaigns, donor drives, and recognition events are held globally. It highlights solidarity and the importance of altruism.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 15,
      "events": [
        {
          "title": "World Elder Abuse Awareness Day",
          "description": "This day highlights the issue of elder abuse and the need to protect older people. It was established by the United Nations to raise awareness and promote prevention measures. The observance emphasizes the rights, dignity, and well-being of older adults. Workshops, campaigns, and advocacy programs are organized worldwide. It encourages communities to respect and support elders.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 16,
      "events": [
        {
          "title": "International Day of Family Remittances",
          "description": "This day recognizes the contributions of migrant workers who send remittances to support their families. It was established by the United Nations to highlight the economic and social impact of remittances. The observance emphasizes financial inclusion, security, and sustainable development. Awareness campaigns and financial literacy programs are organized globally. It promotes understanding of the role of remittances in improving lives.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 17,
      "events": [
        {
          "title": "World Day to Combat Desertification and Drought",
          "description": "This day raises awareness about desertification, land degradation, and drought impacts. It was established by the United Nations to promote sustainable land management. The observance highlights climate action, environmental protection, and sustainable agriculture. Campaigns, workshops, and educational events are held worldwide. It encourages global efforts to restore ecosystems and prevent land degradation.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 18,
      "events": [
        {
          "title": "Sustainable Gastronomy Day [FAO]",
          "description": "Sustainable Gastronomy Day celebrates the link between food, culture, and sustainable development. It was proclaimed by the United Nations and FAO to promote responsible food production and consumption. The observance highlights culinary traditions, local food systems, and environmental sustainability. Events include cooking demonstrations, workshops, and educational campaigns. It encourages mindful eating and protection of culinary heritage.",
          "category": "Worldwide"
        },
        {
          "title": "International Day for Countering Hate Speech",
          "description": "This day promotes awareness and action against hate speech worldwide. It was established by the United Nations to prevent discrimination and violence online and offline. The observance highlights human rights, equality, and respectful communication. Awareness campaigns, workshops, and discussions are conducted globally. It encourages tolerance, dialogue, and peaceful coexistence.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 19,
      "events": [
        {
          "title": "International Day for the Elimination of Sexual Violence in Conflict",
          "description": "This day raises awareness about sexual violence in conflict zones and promotes justice for victims. It was established by the United Nations to prevent sexual violence during wars and conflicts. The observance highlights advocacy, protection, and legal measures. Campaigns, educational programs, and policy discussions are organized worldwide. It encourages global commitment to ending sexual violence in conflicts.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 20,
      "events": [
        {
          "title": "World Refugee Day",
          "description": "World Refugee Day honors refugees and displaced persons globally. It was established by the United Nations to raise awareness of their plight and promote protection. The observance highlights human rights, safety, and humanitarian support. Events include cultural programs, advocacy campaigns, and educational initiatives. It encourages solidarity, compassion, and international cooperation.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 21,
      "events": [
        {
          "title": "International Day of Yoga",
          "description": "International Day of Yoga celebrates the ancient practice of yoga and its benefits for physical, mental, and spiritual well-being. It was established by the United Nations to promote health, harmony, and global unity. The day emphasizes yoga as a tool for stress reduction, mindfulness, and healthy living. Events include public yoga sessions, workshops, and demonstrations worldwide. Schools, communities, and organizations participate to spread awareness of the holistic benefits of yoga.",
          "category": "Worldwide"
        },
        {
          "title": "International Day of the Celebration of the Solstice",
          "description": "This day marks the solstice, the longest or shortest day of the year, depending on the hemisphere. It celebrates natural cycles and cultural traditions linked to the sun’s position. Communities around the world honor this day through rituals, festivals, and educational activities. The observance encourages connection with nature and recognition of seasonal changes. {The date varies based on the astronomical solstice each year.}",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 23,
      "events": [
        {
          "title": "United Nations Public Service Day",
          "description": "United Nations Public Service Day honors the contributions of public service workers globally. It was established by the UN to recognize excellence in public administration and governance. The day highlights innovative solutions, transparency, and service to citizens. Ceremonies, awards, and conferences are organized to showcase outstanding achievements. It encourages good governance and inspires people to engage in public service.",
          "category": "Worldwide"
        },
        {
          "title": "International Widow's Day",
          "description": "International Widow’s Day raises awareness about the challenges faced by widows worldwide. It was established by the United Nations to highlight issues like discrimination, poverty, and social exclusion. The observance promotes support programs, advocacy, and empowerment initiatives. NGOs, governments, and communities organize events to provide assistance and recognition. {The date may vary in some countries according to local observances.}",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 24,
      "events": [
        {
          "title": "International Day of Women in Diplomacy",
          "description": "This day celebrates the contributions of women in international diplomacy and peacebuilding. It was established to highlight gender equality, leadership, and representation in diplomatic roles. Observances include conferences, educational programs, and awards honoring women diplomats. The day encourages equal opportunities and the empowerment of women in foreign policy. It promotes awareness of women’s vital role in shaping global relations.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 25,
      "events": [
        {
          "title": "Day of the Seafarer",
          "description": "The Day of the Seafarer recognizes the invaluable contribution of seafarers to global trade and the economy. It was established by the International Maritime Organization to raise awareness about their working conditions and welfare. The day highlights maritime safety, training, and the role of seafarers in global supply chains. Ceremonies, workshops, and advocacy programs are organized internationally. It honors the dedication and sacrifices of seafarers worldwide.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 26,
      "events": [
        {
          "title": "Muharram",
          "description": "Muharram is the first month of the Islamic calendar and is observed as a period of mourning and reflection, particularly for the martyrdom of Imam Hussain. The day is marked with prayers, processions, and remembrance gatherings by the Muslim community. It emphasizes themes of sacrifice, justice, and spiritual renewal. The observance encourages reflection on moral values and historical events. {The date varies according to the Islamic lunar calendar.}",
          "category": "India"
        },
        {
          "title": "International Day against Drug Abuse and Illicit Trafficking",
          "description": "This day raises awareness of the global drug problem and promotes prevention, treatment, and rehabilitation. It was established by the United Nations to highlight the dangers of drug abuse and the need for action against illicit trafficking. The observance includes educational campaigns, workshops, and law enforcement initiatives. It encourages governments, organizations, and communities to work together for drug-free societies.",
          "category": "Worldwide"
        },
        {
          "title": "International Day in Support of Victims of Torture",
          "description": "This day promotes awareness of the need to prevent torture and support survivors worldwide. It was established by the United Nations to uphold human rights and provide rehabilitation and legal aid. Observances include campaigns, educational programs, and advocacy initiatives. It highlights global solidarity and the commitment to justice and human dignity.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 27,
      "events": [
        {
          "title": "Micro-, Small and Medium-sized Enterprises Day",
          "description": "This day recognizes the contribution of micro, small, and medium-sized enterprises (MSMEs) to sustainable development and economic growth. It was established by the United Nations to highlight entrepreneurship, innovation, and employment generation. Observances include workshops, networking events, and policy discussions. The day encourages support for MSMEs and fosters sustainable business practices.",
          "category": "Worldwide"
        },
        {
          "title": "International Day of Deafblindness",
          "description": "The International Day of Deafblindness raises awareness about people with combined vision and hearing impairments. It was established to promote accessibility, inclusion, and equal opportunities. The day highlights advocacy, education, and support services for the deafblind community. Events include workshops, exhibitions, and campaigns worldwide. It encourages society to recognize the needs and rights of individuals with dual sensory impairments.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 29,
      "events": [
        {
          "title": "International Day of the Tropics",
          "description": "This day celebrates the unique environmental, social, and economic aspects of tropical regions. It was established by the United Nations to promote sustainable development and resilience in tropical areas. Observances include conferences, educational programs, and campaigns highlighting biodiversity, climate change, and sustainable practices. It encourages global awareness of tropical challenges and opportunities.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 30,
      "events": [
        {
          "title": "International Asteroid Day",
          "description": "International Asteroid Day raises awareness about asteroid impacts and planetary defense. It was established by the United Nations to educate the public and promote scientific research on asteroid threats. Observances include educational workshops, seminars, and media campaigns worldwide. The day highlights the importance of space science, monitoring, and preparedness. It encourages global cooperation for the safety of Earth.",
          "category": "Worldwide"
        },
        {
          "title": "International Day of Parliamentarism",
          "description": "This day celebrates the role of parliaments in promoting democracy and good governance. It was established by the United Nations to highlight transparency, accountability, and citizen engagement. Observances include conferences, educational initiatives, and outreach programs. The day encourages dialogue, legislative innovation, and strengthening democratic institutions.",
          "category": "Worldwide"
        }
      ]
    }
  ],
  "jul": [
    {
      "date": 4,
      "events": [
        {
          "title": "International Day of Cooperatives",
          "description": "International Day of Cooperatives recognizes the contribution of cooperatives to sustainable development and community empowerment. It was established by the United Nations to promote cooperative values like solidarity, equality, and mutual help. Observances include exhibitions, workshops, and awareness campaigns. The day encourages people to support cooperatives and community-based economic initiatives.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 6,
      "events": [
        {
          "title": "World Rural Development Day",
          "description": "World Rural Development Day highlights the importance of improving the quality of life in rural communities. It focuses on sustainable agriculture, infrastructure, education, and livelihoods for rural populations. The day emphasizes reducing poverty and inequality between urban and rural areas. Governments, NGOs, and international bodies organize discussions and development initiatives. It promotes inclusive growth and balanced regional development.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 7,
      "events": [
        {
          "title": "World Kiswahili Language Day",
          "description": "World Kiswahili Language Day celebrates Kiswahili as a unifying language across Africa and beyond. It was proclaimed by UNESCO to promote linguistic diversity and cultural heritage. The day highlights the role of Kiswahili in education, diplomacy, and social cohesion. Cultural programs, poetry, and language-learning activities are organized globally. It recognizes Kiswahili as one of the fastest-growing international languages.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 11,
      "events": [
        {
          "title": "World Population Day",
          "description": "World Population Day raises awareness about global population issues such as growth, health, gender equality, and development. It was established by the United Nations to focus attention on population trends and their impact. The day promotes access to healthcare, education, and family planning. Campaigns and discussions emphasize sustainable development and human rights. It encourages informed decisions about population-related challenges.",
          "category": "Worldwide"
        },
        {
          "title": "International Day of Reflection and Commemoration of the 1995 Genocide in Srebrenica",
          "description": "This day honors the victims of the 1995 genocide in Srebrenica and promotes remembrance and justice. It was established by the United Nations to acknowledge the atrocities and prevent future genocides. The observance emphasizes human rights, accountability, and reconciliation. Memorial ceremonies, discussions, and educational programs are held worldwide. It reinforces the importance of learning from history to protect humanity.",
          "category": "Worldwide"
        },
        {
          "title": "World Horse Day",
          "description": "World Horse Day celebrates the historical, cultural, and economic importance of horses to human civilization. It highlights the role of horses in transport, agriculture, sports, and companionship. The day promotes animal welfare and responsible care of horses. Events include exhibitions, educational programs, and equestrian activities. It recognizes the deep bond between humans and horses.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 12,
      "events": [
        {
          "title": "International Day of Combating Sand and Dust Storms",
          "description": "This day raises awareness about the environmental and health impacts of sand and dust storms. It was established by the United Nations to promote cooperation in managing land degradation and climate change. The observance highlights the need for sustainable land use and early warning systems. Educational campaigns and policy discussions are organized globally. It encourages joint action to reduce the risks caused by these natural phenomena.",
          "category": "Worldwide"
        },
        {
          "title": "International Day of Hope",
          "description": "International Day of Hope promotes optimism, resilience, and positive action in times of global challenges. The day encourages individuals and communities to focus on unity, compassion, and mental well-being. It highlights the power of hope in overcoming adversity. Activities include motivational events, community programs, and awareness campaigns. The observance inspires collective efforts toward a better future.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 15,
      "events": [
        {
          "title": "World Youth Skills Day",
          "description": "World Youth Skills Day highlights the importance of equipping young people with skills for employment and entrepreneurship. It was established by the United Nations to address youth unemployment and workforce readiness. The day focuses on technical, vocational, and digital skills. Workshops, training programs, and career guidance events are organized worldwide. It supports youth empowerment and sustainable economic growth.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 16,
      "events": [
        {
          "title": "Rath Yatra",
          "description": "Rath Yatra is a major Hindu festival celebrating the annual journey of Lord Jagannath, along with Lord Balabhadra and Goddess Subhadra. The festival is most famously celebrated in Puri, Odisha, with grand chariot processions. Devotees pull decorated chariots and participate in prayers and cultural events. The celebration symbolizes unity, devotion, and spiritual journey. {The date varies each year based on the Hindu lunar calendar.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 18,
      "events": [
        {
          "title": "Nelson Mandela International Day",
          "description": "Nelson Mandela International Day honors the legacy of Nelson Mandela and his commitment to peace, justice, and equality. It was established by the United Nations to encourage community service and social responsibility. The day inspires people to contribute positively to society through volunteerism. Activities include charity drives, educational programs, and awareness campaigns. It celebrates values of forgiveness, leadership, and human dignity.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 20,
      "events": [
        {
          "title": "World Chess Day",
          "description": "World Chess Day celebrates the game of chess and its contribution to intellectual development and strategic thinking. It marks the founding of the International Chess Federation (FIDE). The day highlights chess as a tool for education, concentration, and problem-solving. Tournaments, exhibitions, and learning sessions are organized globally. It promotes chess as a universal and inclusive game.",
          "category": "Worldwide"
        },
        {
          "title": "International Moon Day",
          "description": "International Moon Day commemorates human achievements in lunar exploration and space science. It was established by the United Nations to mark the first human landing on the Moon. The day promotes awareness of peaceful space exploration and scientific progress. Educational events, exhibitions, and discussions are held worldwide. It inspires interest in astronomy and future space missions.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 25,
      "events": [
        {
          "title": "World Drowning Prevention Day",
          "description": "World Drowning Prevention Day raises awareness about drowning as a major public health issue. It was established by the United Nations to promote water safety and preventive measures. The day emphasizes education, swimming skills, and community preparedness. Campaigns and training programs aim to reduce drowning-related deaths. It encourages global action to save lives through prevention.",
          "category": "Worldwide"
        },
        {
          "title": "International Day of Women and Girls of African Descent",
          "description": "This day recognizes the contributions, resilience, and rights of women and girls of African descent. It was established by the United Nations to address discrimination and promote equality. The observance highlights leadership, cultural heritage, and empowerment. Events include discussions, cultural programs, and advocacy initiatives. It promotes inclusion, dignity, and social justice.",
          "category": "Worldwide"
        },
        {
          "title": "International Day for Judicial Well-being",
          "description": "International Day for Judicial Well-being focuses on the mental and emotional health of judges and judicial professionals. It highlights the importance of well-being for maintaining justice, integrity, and fair decision-making. The day encourages support systems and stress management within the judiciary. Seminars and awareness programs promote healthier work environments. It emphasizes that judicial independence is strengthened through personal well-being.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 28,
      "events": [
        {
          "title": "World Hepatitis Day [WHO]",
          "description": "World Hepatitis Day raises awareness about viral hepatitis and its impact on global health. It is observed under the leadership of the World Health Organization to promote prevention, testing, and treatment. The day highlights the burden of liver disease caused by hepatitis B and C. Governments and health organizations conduct screenings and awareness campaigns. It encourages global action to eliminate hepatitis as a public health threat.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 30,
      "events": [
        {
          "title": "International Day of Friendship",
          "description": "International Day of Friendship celebrates the role of friendship in promoting peace, understanding, and solidarity among people and nations. It was proclaimed by the United Nations to encourage bonds across cultures and communities. The day highlights kindness, mutual respect, and social harmony. People celebrate by strengthening personal relationships and organizing community activities. It reminds societies that friendship can bridge differences and conflicts.",
          "category": "Worldwide"
        },
        {
          "title": "World Day against Trafficking in Persons",
          "description": "World Day against Trafficking in Persons raises awareness about human trafficking and the suffering of victims. It was established by the United Nations to promote prevention and protection of human rights. The day highlights issues such as forced labor, exploitation, and modern slavery. Campaigns focus on victim support, law enforcement, and public education. It calls for collective action to end human trafficking worldwide.",
          "category": "Worldwide"
        }
      ]
    }
  ],
  "aug": [
    {
      "date": 6,
      "events": [
        {
          "title": "International Day of Awareness of the Special Development Needs and Challenges of Landlocked Developing Countries",
          "description": "This day highlights the unique economic and developmental challenges faced by landlocked developing countries. It was established by the United Nations to promote international cooperation and support. The observance focuses on trade barriers, infrastructure gaps, and limited access to global markets. Discussions and policy initiatives aim to promote sustainable development. It emphasizes the need for global partnerships to address geographic disadvantages.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 9,
      "events": [
        {
          "title": "International Day of the World's Indigenous Peoples",
          "description": "International Day of the World’s Indigenous Peoples recognizes the cultures, traditions, and contributions of Indigenous communities worldwide. It was proclaimed by the United Nations to promote their rights and well-being. The day highlights issues such as land rights, education, and cultural preservation. Cultural events, discussions, and advocacy programs are organized globally. It supports inclusion, dignity, and respect for Indigenous identities.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 11,
      "events": [
        {
          "title": "World Steelpan Day",
          "description": "World Steelpan Day celebrates the steelpan, a musical instrument that originated in Trinidad and Tobago. It recognizes the cultural significance and global influence of steelpan music. The day promotes creativity, heritage, and musical education. Concerts, performances, and workshops are held worldwide. It honors the steelpan as a symbol of resilience and artistic expression.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 12,
      "events": [
        {
          "title": "International Youth Day",
          "description": "International Youth Day focuses on the role of young people in shaping a better future. It was established by the United Nations to highlight youth-related challenges and opportunities. Each year emphasizes themes such as education, employment, and social inclusion. Events include discussions, campaigns, and youth-led initiatives. It encourages youth participation in decision-making and development.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 15,
      "events": [
        {
          "title": "Independence Day",
          "description": "Independence Day marks India’s freedom from British colonial rule in 1947. It honors the sacrifices of freedom fighters and the nation’s journey toward sovereignty. The Prime Minister hoists the national flag and addresses the nation from the Red Fort. Celebrations include parades, cultural programs, and patriotic activities. The day symbolizes unity, democracy, and national pride.",
          "category": "India"
        },
        {
          "title": "Parsi New Year's day/ Nauraj",
          "description": "Parsi New Year, also known as Nauraj, marks the beginning of the new year in the Zoroastrian calendar. It is celebrated by the Parsi community with prayers, family gatherings, and festive meals. Fire temples hold special ceremonies for peace and prosperity. The day symbolizes renewal, gratitude, and hope. {The date varies based on the Zoroastrian calendar.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 19,
      "events": [
        {
          "title": "World Humanitarian Day",
          "description": "World Humanitarian Day honors humanitarian workers who risk their lives to help people in crisis. It was established by the United Nations to recognize compassion and selfless service. The day raises awareness about humanitarian challenges worldwide. Campaigns highlight conflict zones, disasters, and aid efforts. It encourages global solidarity and support for humanitarian causes.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 21,
      "events": [
        {
          "title": "International Day of Remembrance and Tribute to the Victims of Terrorism",
          "description": "This day honors the memory of victims and survivors of terrorism worldwide. It was established by the United Nations to promote solidarity and support. The observance highlights the human cost of terrorism and the need for justice. Memorial events and awareness programs are held globally. It reinforces commitment to peace and human dignity.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 22,
      "events": [
        {
          "title": "International Day Commemorating the Victims of Acts of Violence Based on Religion or Belief",
          "description": "This day remembers victims of violence caused by religious intolerance and discrimination. It was proclaimed by the United Nations to promote freedom of religion and belief. The observance highlights the importance of tolerance and coexistence. Discussions and campaigns focus on preventing hate-based violence. It calls for unity, respect, and peaceful dialogue.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 23,
      "events": [
        {
          "title": "International Day for the Remembrance of the Slave Trade and its Abolition",
          "description": "This day commemorates the victims of the transatlantic slave trade and honors those who resisted slavery. It was established by UNESCO to educate people about historical injustices. The observance highlights the lasting impact of slavery and racism. Educational programs and memorial events are organized worldwide. It promotes remembrance, reconciliation, and human rights.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 26,
      "events": [
        {
          "title": "Milad- un- Nabi or Id- e- Milad (Birthday of Prophet Mohammad)",
          "description": "Milad-un-Nabi marks the birth of Prophet Muhammad and celebrates his teachings of peace and compassion. The day is observed with prayers, sermons, and charitable activities. Mosques and homes are decorated, and religious gatherings are held. It emphasizes moral values, kindness, and unity. {The date varies based on the Islamic lunar calendar.}",
          "category": "India"
        },
        {
          "title": "Onam",
          "description": "Onam is a major harvest festival celebrated primarily in Kerala. It marks the legendary return of King Mahabali and symbolizes prosperity and unity. The festival features floral decorations, traditional dances, boat races, and grand feasts. Homes are decorated with flower rangolis called pookalams. {The date varies according to the Malayalam calendar.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 27,
      "events": [
        {
          "title": "World Lake Day",
          "description": "World Lake Day highlights the importance of lakes in maintaining ecological balance and supporting livelihoods. It raises awareness about freshwater conservation, biodiversity, and climate impacts on lake ecosystems. The day encourages sustainable management and protection of lakes worldwide. Environmental groups and communities organize clean-up drives and awareness programs. It emphasizes the role of lakes in water security and sustainable development.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 28,
      "events": [
        {
          "title": "Raksha Bandhan",
          "description": "Raksha Bandhan celebrates the bond of love and protection between brothers and sisters. Sisters tie a rakhi on their brothers’ wrists as a symbol of care and affection. Brothers, in return, promise to protect and support their sisters. The festival strengthens family relationships and cultural values. {The date varies based on the Hindu lunar calendar.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 29,
      "events": [
        {
          "title": "International Day against Nuclear Tests",
          "description": "This day raises awareness about the dangers of nuclear test explosions. It was established by the United Nations to promote a nuclear-weapon-free world. The observance highlights the environmental and human consequences of nuclear testing. Global discussions and campaigns advocate for disarmament and peace. It reinforces the need for international cooperation to end nuclear tests.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 30,
      "events": [
        {
          "title": "International Day of the Victims of Enforced Disappearances",
          "description": "This day honors victims who have disappeared due to enforced actions and supports their families. It was proclaimed by the United Nations to raise awareness about human rights violations. The observance calls for truth, justice, and accountability. Awareness campaigns highlight the need for legal protection and international action. It promotes dignity and remembrance for victims.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 31,
      "events": [
        {
          "title": "International Day for People of African Descent",
          "description": "This day celebrates the history, culture, and contributions of people of African descent worldwide. It was established by the United Nations to promote inclusion and equality. The observance addresses issues of discrimination, racism, and social justice. Cultural programs and discussions are organized globally. It supports dignity, development, and human rights.",
          "category": "Worldwide"
        }
      ]
    }
  ],
  "sep": [
    {
      "date": 4,
      "events": [
        {
          "title": "Janmashtami (Vaishnva)",
          "description": "Janmashtami marks the birth of Lord Krishna, a central figure in Hinduism. Devotees observe fasts, sing devotional songs, and reenact episodes from Krishna’s life. Temples are decorated, and midnight prayers are offered to mark his birth. The festival symbolizes righteousness, love, and devotion. {The date varies according to the Hindu lunar calendar.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 5,
      "events": [
        {
          "title": "International Day of Charity",
          "description": "International Day of Charity promotes generosity and support for humanitarian causes. It was established by the United Nations to encourage charitable activities worldwide. The day highlights the role of philanthropy in addressing poverty and crises. Organizations and individuals engage in donations and volunteer work. It inspires compassion and social responsibility.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 7,
      "events": [
        {
          "title": "International Day of Clean Air for Blue Skies [UNEP]",
          "description": "This day raises awareness about air pollution and its impact on health and the environment. It is supported by the United Nations Environment Programme to promote clean air solutions. The observance encourages governments and communities to reduce emissions. Campaigns focus on sustainable practices and policy action. It emphasizes the right to breathe clean air.",
          "category": "Worldwide"
        },
        {
          "title": "International Day of Police Cooperation",
          "description": "International Day of Police Cooperation highlights collaboration among law enforcement agencies worldwide. It marks the establishment of INTERPOL and its role in global security. The day emphasizes crime prevention, information sharing, and international coordination. Events promote professionalism and ethical policing. It strengthens trust and cooperation across borders.",
          "category": "Worldwide"
        },
        {
          "title": "World Duchenne Awareness Day",
          "description": "World Duchenne Awareness Day raises awareness about Duchenne muscular dystrophy. It highlights the challenges faced by patients and their families. The day promotes research, early diagnosis, and support services. Awareness campaigns encourage inclusion and medical advancement. It aims to improve quality of life for those affected.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 8,
      "events": [
        {
          "title": "International Literacy Day [UNESCO]",
          "description": "International Literacy Day emphasizes the importance of literacy for education and development. It was established by UNESCO to promote reading and writing skills worldwide. The observance highlights literacy as a foundation for equality and empowerment. Educational programs and campaigns are organized globally. It supports lifelong learning and social progress.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 9,
      "events": [
        {
          "title": "International Day to Protect Education from Attack",
          "description": "This day draws attention to attacks on students, teachers, and educational institutions. It was proclaimed by the United Nations to safeguard education during conflicts. The observance highlights the need for safe learning environments. Advocacy efforts promote international laws and protections. It reinforces education as a fundamental human right.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 12,
      "events": [
        {
          "title": "United Nations Day for South-South Cooperation",
          "description": "This day promotes collaboration among developing countries to achieve shared development goals. It highlights knowledge exchange, innovation, and mutual support. The United Nations encourages partnerships to address global challenges. Discussions focus on sustainable growth and solidarity. It strengthens cooperation among nations of the Global South.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 14,
      "events": [
        {
          "title": "Ganesh Chaturthi / Vinayaka Chaturthi",
          "description": "Ganesh Chaturthi celebrates the birth of Lord Ganesha, the remover of obstacles. Devotees install idols, offer prayers, and participate in cultural events. The festival ends with immersion ceremonies symbolizing renewal. It promotes unity, devotion, and environmental awareness. {The date varies based on the Hindu lunar calendar.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 15,
      "events": [
        {
          "title": "International Day of Democracy",
          "description": "International Day of Democracy highlights the importance of democratic values and institutions. It was established by the United Nations to promote participation and human rights. The day encourages dialogue on governance and civic engagement. Events focus on freedom, equality, and the rule of law. It reinforces democracy as a foundation for peace and development.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 16,
      "events": [
        {
          "title": "International Day for the Preservation of the Ozone Layer",
          "description": "This day raises awareness about the importance of protecting the Earth’s ozone layer. It commemorates the signing of the Montreal Protocol, which aims to reduce substances that damage ozone. The observance highlights how ozone protection helps prevent harmful ultraviolet radiation. Governments and organizations promote environmental responsibility on this day. It also showcases global cooperation in addressing climate-related challenges.",
          "category": "Worldwide"
        },
        {
          "title": "International Day for Interventional Cardiology",
          "description": "This day recognizes the role of interventional cardiology in treating heart diseases using minimally invasive procedures. It highlights advancements such as angioplasty and stent placement that save lives. The observance promotes awareness of heart health and modern medical innovation. Medical professionals share knowledge and best practices. It emphasizes early diagnosis and effective treatment of cardiovascular conditions.",
          "category": "Worldwide"
        },
        {
          "title": "International Day of Science, Technology and Innovation for the South",
          "description": "This day highlights the role of science and technology in supporting development in the Global South. It was established by the United Nations to reduce technological gaps between nations. The observance promotes innovation, research, and digital inclusion. Discussions focus on sustainable development and problem-solving. It encourages global cooperation through scientific progress.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 17,
      "events": [
        {
          "title": "World Patient Safety Day",
          "description": "World Patient Safety Day focuses on improving safety in healthcare systems. It was established by the World Health Organization to reduce medical errors and harm. The day promotes safe practices for patients and healthcare workers. Awareness campaigns emphasize accountability and quality care. It aims to strengthen trust in healthcare services.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 18,
      "events": [
        {
          "title": "International Equal Pay Day",
          "description": "This day highlights the persistent gender pay gap worldwide. It was proclaimed by the United Nations to promote equal pay for work of equal value. The observance raises awareness about economic inequality and discrimination. Governments and organizations discuss fair wage policies. It supports gender equality and social justice.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 19,
      "events": [
        {
          "title": "World Cleanup Day",
          "description": "World Cleanup Day encourages people to take action against global waste and pollution. Millions of volunteers participate in clean-up drives across land and water bodies. The day promotes environmental responsibility and sustainable habits. It raises awareness about waste management and plastic pollution. {The date varies as it is observed on the third Saturday of September.}",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 21,
      "events": [
        {
          "title": "International Day of Peace",
          "description": "This day promotes peace, harmony, and non-violence across the world. It was established by the United Nations to strengthen ideals of peace among nations. The observance encourages dialogue, tolerance, and conflict resolution. Peace events and campaigns are held globally. It reminds people of the importance of unity and cooperation.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 23,
      "events": [
        {
          "title": "International Day of Sign Languages",
          "description": "This day celebrates sign languages as full and equal languages of communication. It highlights the cultural and linguistic identity of deaf communities. The United Nations promotes inclusion and accessibility through this observance. Awareness programs focus on education and rights of deaf individuals. It supports equal participation in society.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 24,
      "events": [
        {
          "title": "World Maritime Day",
          "description": "World Maritime Day highlights the importance of the maritime industry in global trade and development. It is observed under the guidance of the International Maritime Organization. The day focuses on maritime safety, environmental protection, and innovation. Discussions address challenges faced by the shipping industry. {The date varies as it is observed on the last Thursday of September.}",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 26,
      "events": [
        {
          "title": "International Day for the Total Elimination of Nuclear Weapons",
          "description": "This day emphasizes the urgent need to eliminate nuclear weapons. It was proclaimed by the United Nations to promote global disarmament. The observance highlights the humanitarian and environmental risks of nuclear arms. Advocacy efforts focus on peace and international security. It encourages cooperation toward a safer world.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 27,
      "events": [
        {
          "title": "World Tourism Day",
          "description": "World Tourism Day highlights the social, cultural, and economic importance of tourism. It is led by the World Tourism Organization to promote sustainable tourism. The observance focuses on responsible travel and cultural exchange. Events emphasize tourism’s role in development and employment. It encourages mindful and inclusive travel practices.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 28,
      "events": [
        {
          "title": "International Day for Universal Access to Information",
          "description": "This day promotes the right to seek and receive information. It was established by UNESCO to support transparency and accountability. The observance highlights freedom of information as a democratic principle. Discussions focus on digital access and open data. It empowers citizens through knowledge.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 29,
      "events": [
        {
          "title": "International Day of Awareness of Food Loss and Waste",
          "description": "This day raises awareness about reducing food loss and waste globally. It highlights the impact of waste on food security and the environment. The United Nations promotes sustainable consumption through this observance. Campaigns encourage better storage, distribution, and consumption habits. It supports global efforts to end hunger.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 30,
      "events": [
        {
          "title": "International Translation Day",
          "description": "International Translation Day recognizes the role of translators and interpreters in connecting cultures. It honors professionals who enable communication across languages. The day highlights the importance of linguistic diversity. Cultural and educational institutions mark the occasion worldwide. It promotes understanding and global cooperation.",
          "category": "Worldwide"
        }
      ]
    }
  ],
  "oct": [
    {
      "date": 1,
      "events": [
        {
          "title": "International Day of Older Persons",
          "description": "This day focuses on the rights, dignity, and well-being of older persons. It was established by the United Nations to address aging-related issues. The observance highlights healthcare, social inclusion, and security for the elderly. Awareness programs promote respect and support for older generations. It emphasizes active and healthy aging.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 2,
      "events": [
        {
          "title": "Gandhi Jayanti",
          "description": "Gandhi Jayanti commemorates the birth anniversary of Mahatma Gandhi, the leader of India’s freedom movement. It honors his principles of truth, non-violence, and peaceful resistance. The day is observed with prayer meetings, tributes, and cleanliness drives. Educational institutions reflect on his teachings and legacy. It also serves as a reminder of ethical leadership and social responsibility.",
          "category": "India"
        },
        {
          "title": "International Day of Non-Violence",
          "description": "This day promotes the principles of non-violence as advocated by Mahatma Gandhi. It was established by the United Nations to encourage peaceful conflict resolution. The observance highlights tolerance, dialogue, and mutual respect. Events focus on peace education and human rights. It reinforces non-violence as a universal value.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 5,
      "events": [
        {
          "title": "World Teachers' Day",
          "description": "World Teachers’ Day celebrates the role of teachers in shaping societies. It was established by UNESCO to recognize their contribution to education and development. The day highlights challenges faced by educators worldwide. Schools and institutions honor teachers through events and tributes. It emphasizes the importance of quality education for all.",
          "category": "Worldwide"
        },
        {
          "title": "World Habitat Day",
          "description": "World Habitat Day focuses on the state of human settlements and the right to adequate housing. It was established by the United Nations to promote sustainable urban development. The observance highlights issues like urban planning, housing, and inclusivity. Governments and organizations discuss sustainable cities. {The date varies as it is observed on the first Monday of October.}",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 7,
      "events": [
        {
          "title": "World Cotton Day",
          "description": "World Cotton Day highlights the importance of cotton in global trade and livelihoods. It recognizes the role of cotton farmers, especially in developing countries. The day promotes sustainable cotton production. Discussions focus on fair trade and innovation. It supports economic growth and rural development.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 9,
      "events": [
        {
          "title": "World Post Day",
          "description": "World Post Day marks the anniversary of the establishment of the Universal Postal Union. It highlights the role of postal services in communication and commerce. The day celebrates connectivity across nations. Awareness programs focus on innovation in postal services. It recognizes postal workers worldwide.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 10,
      "events": [
        {
          "title": "World Mental Health Day",
          "description": "World Mental Health Day raises awareness about mental health issues globally. It promotes understanding, care, and support for mental well-being. The observance encourages open conversations to reduce stigma. Organizations and communities host awareness campaigns. It emphasizes access to mental health care for all.",
          "category": "Worldwide"
        },
        {
          "title": "World Migratory Bird Day [UNEP]",
          "description": "This day raises awareness about the conservation of migratory birds and their habitats. It highlights threats such as climate change and habitat loss. The observance promotes international cooperation for wildlife protection. Nature walks and educational programs are organized. {The date varies as it is observed on the second Saturday of October.}",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 11,
      "events": [
        {
          "title": "International Day of the Girl Child",
          "description": "This day focuses on the rights and empowerment of girls worldwide. It addresses challenges such as education, health, and gender inequality. The United Nations promotes awareness through campaigns and discussions. The observance highlights the importance of equal opportunities. It supports the development and protection of girls.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 13,
      "events": [
        {
          "title": "International Day for Disaster Risk Reduction",
          "description": "This day promotes awareness about reducing risks from natural and human-made disasters. It was established by the United Nations to encourage preparedness and resilience. The observance highlights early warning systems and disaster planning. Governments and communities share best practices. It aims to save lives and reduce damage.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 15,
      "events": [
        {
          "title": "International Day of Rural Women",
          "description": "This day recognizes the contributions of rural women to agriculture and development. It highlights their role in food security and poverty reduction. The observance raises awareness about challenges faced by rural women. Programs promote gender equality and empowerment. It supports sustainable rural development.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 16,
      "events": [
        {
          "title": "World Food Day [FAO]",
          "description": "World Food Day raises awareness about hunger and food security. It is led by the Food and Agriculture Organization of the United Nations. The day promotes sustainable agriculture and nutrition. Campaigns focus on ending hunger worldwide. It emphasizes access to safe and nutritious food.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 17,
      "events": [
        {
          "title": "International Day for the Eradication of Poverty",
          "description": "This day highlights the global effort to end poverty in all its forms. It was established by the United Nations to promote dignity and human rights. The observance focuses on social inclusion and equality. Awareness programs highlight the voices of marginalized communities. It encourages collective action against poverty.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 18,
      "events": [
        {
          "title": "Dusshera (Saptami)",
          "description": "Dusshera Saptami marks the seventh day of the Durga Puja celebrations. It honors Goddess Durga and her divine power. Devotees participate in rituals and cultural programs. The day reflects themes of courage and righteousness. {The date varies as it is based on the Hindu lunar calendar.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 19,
      "events": [
        {
          "title": "Dusshera (Mahashtami)",
          "description": "Dusshera Mahashtami is one of the most significant days of Durga Puja. It commemorates Goddess Durga’s battle against evil forces. Special prayers and rituals are performed with devotion. Communities celebrate with music and cultural events. {The date varies as it is based on the Hindu lunar calendar.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 20,
      "events": [
        {
          "title": "Dusshera",
          "description": "Dusshera, also known as Vijayadashami, celebrates the victory of good over evil. It marks the defeat of Ravana by Lord Rama and the triumph of Goddess Durga over Mahishasura. The day symbolizes righteousness, courage, and moral values. Celebrations include burning effigies, processions, and cultural performances. It is observed across India with regional variations. {The date varies as it is based on the Hindu lunar calendar.}",
          "category": "India"
        },
        {
          "title": "Dusshera (Mahanavmi)",
          "description": "Mahanavami is the ninth day of the Dusshera or Durga Puja festival. It honors Goddess Durga in her most powerful form. Devotees perform special prayers, rituals, and weapon worship in some traditions. Cultural programs and community gatherings mark the day. It represents strength, protection, and victory over negative forces. {The date varies as it is based on the Hindu lunar calendar.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 23,
      "events": [
        {
          "title": "International Day of the Snow Leopard",
          "description": "This day raises awareness about the conservation of snow leopards and their fragile mountain ecosystems. It highlights threats such as climate change, habitat loss, and poaching. Governments and conservation groups promote protection efforts in high-altitude regions. Educational programs emphasize biodiversity and sustainable development. The day supports international cooperation for wildlife conservation.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 24,
      "events": [
        {
          "title": "United Nations Day",
          "description": "United Nations Day marks the anniversary of the UN Charter coming into force. It highlights the role of the United Nations in promoting peace, human rights, and global cooperation. The day reflects on international solidarity and diplomacy. Events include discussions, cultural programs, and awareness campaigns. It reinforces the importance of multilateral action.",
          "category": "Worldwide"
        },
        {
          "title": "World Development Information Day",
          "description": "This day focuses on raising awareness about development issues worldwide. It emphasizes the importance of sharing information for global progress. The United Nations promotes dialogue on economic and social development. Educational institutions and organizations host discussions and seminars. It supports informed decision-making for sustainable development.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 26,
      "events": [
        {
          "title": "Maharishi Valmiki's Birthday",
          "description": "Maharishi Valmiki’s Birthday honors the sage who authored the epic Ramayana. He is revered as one of the greatest poets and spiritual figures in Indian tradition. Devotees remember his teachings on morality and devotion. Temples and communities organize prayers and cultural events. The day celebrates wisdom and literary heritage. {The date varies as it is based on the Hindu lunar calendar.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 27,
      "events": [
        {
          "title": "World Day for Audiovisual Heritage",
          "description": "This day highlights the importance of preserving audiovisual materials such as films, recordings, and broadcasts. It was established by UNESCO to protect cultural and historical records. The observance raises awareness about digital preservation challenges. Archives and institutions showcase their collections. It emphasizes safeguarding heritage for future generations.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 29,
      "events": [
        {
          "title": "International Day of Care and Support",
          "description": "This day recognizes the importance of care work and support systems in society. It highlights the role of caregivers in health, education, and social well-being. The United Nations promotes policies for inclusive care systems. Discussions focus on shared responsibility and dignity. The day supports social justice and equality.",
          "category": "Worldwide"
        },
        {
          "title": "Karaka Chaturthi (Karwa Chouth)",
          "description": "Karaka Chaturthi, popularly known as Karwa Chouth, is observed by married women for the well-being of their husbands. Women fast from sunrise to moonrise and perform traditional rituals. The festival symbolizes love, devotion, and marital bond. Families gather for prayers and celebrations. It is widely observed in northern and western India. {The date varies as it is based on the Hindu lunar calendar.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 31,
      "events": [
        {
          "title": "World Cities Day",
          "description": "World Cities Day focuses on promoting sustainable urban development. It highlights challenges related to housing, infrastructure, and inclusivity. The United Nations encourages discussions on smart and resilient cities. Events include policy dialogues and awareness campaigns. The day emphasizes improving urban life for all.",
          "category": "Worldwide"
        }
      ]
    }
  ],
  "nov": [
    {
      "date": 2,
      "events": [
        {
          "title": "International Day to End Impunity for Crimes against Journalists",
          "description": "This day raises awareness about violence against journalists worldwide. It promotes accountability and protection of press freedom. The United Nations highlights the importance of free and independent media. Events focus on safety, justice, and human rights. The observance supports transparency and democracy.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 5,
      "events": [
        {
          "title": "World Tsunami Awareness Day",
          "description": "World Tsunami Awareness Day promotes preparedness against tsunami risks. It emphasizes early warning systems and disaster education. The United Nations encourages international cooperation for disaster risk reduction. Awareness programs focus on saving lives and reducing damage. The day strengthens global resilience.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 6,
      "events": [
        {
          "title": "International Day for Preventing the Exploitation of the Environment in War and Armed Conflict",
          "description": "This day highlights the environmental impact of armed conflicts. It raises awareness about protecting natural resources during wars. The United Nations promotes international laws and cooperation. Educational programs focus on sustainability and peace. It emphasizes responsibility towards the environment.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 8,
      "events": [
        {
          "title": "Diwali (Deepavali)",
          "description": "Diwali, the Festival of Lights, celebrates the victory of light over darkness and good over evil. It marks Lord Rama’s return to Ayodhya and is also associated with Goddess Lakshmi. Homes are decorated with lamps, rangoli, and fireworks. Families gather for prayers, sweets, and celebrations. Diwali symbolizes prosperity, hope, and renewal. {The date varies as it is based on the Hindu lunar calendar.}",
          "category": "India"
        },
        {
          "title": "Naraka Chaturdasi",
          "description": "Naraka Chaturdasi, also known as Choti Diwali, commemorates Lord Krishna’s victory over the demon Narakasura. It symbolizes the triumph of righteousness over evil. The day is observed with early morning rituals and lighting lamps. It marks the beginning of Diwali celebrations in many regions. The festival represents purification and spiritual renewal. {The date varies as it is based on the Hindu lunar calendar.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 9,
      "events": [
        {
          "title": "Govardhan Puja",
          "description": "Govardhan Puja commemorates Lord Krishna lifting the Govardhan Hill to protect villagers from heavy rains. It emphasizes gratitude toward nature and divine protection. Devotees prepare large food offerings, symbolizing abundance and devotion. The festival is celebrated mainly in North India with prayers and community feasts. It highlights humility, faith, and respect for nature. {The date varies as it is based on the Hindu lunar calendar.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 10,
      "events": [
        {
          "title": "World Science Day for Peace and Development",
          "description": "This day highlights the role of science in promoting peace and sustainable development. It was established by UNESCO to strengthen public awareness of science. Educational institutions organize lectures and exhibitions. The day encourages scientific cooperation across nations. It emphasizes responsible use of scientific advancements.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 11,
      "events": [
        {
          "title": "Bhai Duj",
          "description": "Bhai Duj celebrates the bond between brothers and sisters. Sisters perform rituals for their brothers’ well-being, while brothers offer gifts. The festival strengthens family relationships and mutual care. It is observed shortly after Diwali across India. Bhai Duj symbolizes love, protection, and harmony. {The date varies as it is based on the Hindu lunar calendar.}",
          "category": "India"
        }
      ]
    },
    {
      "date": 14,
      "events": [
        {
          "title": "World Diabetes Day",
          "description": "World Diabetes Day raises awareness about diabetes prevention and management. It was established by the International Diabetes Federation and WHO. Campaigns focus on healthy lifestyles and early diagnosis. The blue circle represents global unity against diabetes. The day supports education and public health initiatives.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 15,
      "events": [
        {
          "title": "Pratihar Shashthi or Surya Shashthi (Chhat Puja)",
          "description": "Chhat Puja is dedicated to worshipping the Sun God and Chhathi Maiya. Devotees observe strict rituals and fasting for family prosperity. Offerings are made at riverbanks during sunrise and sunset. The festival highlights discipline, gratitude, and environmental harmony. It is widely celebrated in Bihar, Jharkhand, and eastern Uttar Pradesh. {The date varies as it is based on the Hindu lunar calendar.}",
          "category": "India"
        },
        {
          "title": "World Day of Remembrance for Road Traffic Victims",
          "description": "This day honors victims of road traffic accidents worldwide. It raises awareness about road safety and responsible driving. Governments and NGOs promote preventive measures and policies. The observance supports affected families and survivors. It emphasizes saving lives through safer roads. {The date varies as it is observed on the third Sunday of November.}",
          "category": "Worldwide"
        },
        {
          "title": "International Day for the Prevention of and Fight against All Forms of Transnational Organized Crime",
          "description": "This day highlights global efforts to combat organized crime. It raises awareness about trafficking, corruption, and illegal trade. The United Nations promotes international cooperation and law enforcement. Discussions focus on justice and public safety. The day supports global peace and security.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 16,
      "events": [
        {
          "title": "International Day for Tolerance [UNESCO]",
          "description": "This day promotes mutual respect and understanding among cultures. It was established by UNESCO to combat intolerance and discrimination. Educational programs encourage dialogue and inclusion. The observance supports peaceful coexistence. It emphasizes unity in diversity.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 18,
      "events": [
        {
          "title": "World Day for the Prevention of and Healing from Child Sexual Exploitation, Abuse and Violence",
          "description": "This day raises awareness about protecting children from abuse and violence. It highlights prevention, healing, and survivor support. Governments and organizations promote child rights and safety. Educational campaigns encourage reporting and protection mechanisms. The day reinforces commitment to child dignity and justice.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 19,
      "events": [
        {
          "title": "World Toilet Day",
          "description": "World Toilet Day focuses on sanitation and access to clean toilets. It highlights the importance of hygiene for public health. The United Nations raises awareness about sanitation challenges worldwide. Campaigns emphasize dignity and disease prevention. The day supports Sustainable Development Goals.",
          "category": "Worldwide"
        },
        {
          "title": "World Philosophy Day [UNESCO]",
          "description": "This day encourages philosophical thinking and critical reflection. UNESCO established it to promote dialogue and intellectual inquiry. Academic institutions host discussions and lectures. Philosophy is highlighted as a tool for peace and understanding. The day supports freedom of thought. {The date varies as it is observed on the third Thursday of November.}",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 20,
      "events": [
        {
          "title": "World Children's Day",
          "description": "World Children's Day promotes children's rights and well-being. It marks the adoption of the Convention on the Rights of the Child. UNICEF leads global awareness initiatives. Activities focus on education, health, and protection. The day celebrates children as the future of humanity.",
          "category": "Worldwide"
        },
        {
          "title": "Africa Industrialization Day",
          "description": "This day highlights Africa’s industrial development and economic growth. It was established by the United Nations to promote sustainable industrialization. Discussions focus on innovation and job creation. The observance supports regional development goals. It emphasizes inclusive economic progress.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 21,
      "events": [
        {
          "title": "World Television Day",
          "description": "World Television Day recognizes the influence of television in communication. It highlights television’s role in education and global awareness. The United Nations promotes its use for peace and development. Media discussions reflect on responsible broadcasting. The day emphasizes the power of visual media.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 24,
      "events": [
        {
          "title": "Guru Nanak's Birthday",
          "description": "Guru Nanak’s Birthday celebrates the birth of the founder of Sikhism. It highlights his teachings on equality, service, and devotion. Devotees participate in prayers, processions, and community meals. The festival promotes unity and compassion. It is observed with reverence across India and globally. {The date varies as it is based on the Sikh lunar calendar.}",
          "category": "India"
        },
        {
          "title": "Guru Teg Bahadur's Martyrdom Day",
          "description": "Guru Teg Bahadur's Martyrdom Day commemorates the sacrifice of the ninth Sikh Guru for religious freedom. He stood against forced conversions and defended the right to practice faith freely. The day highlights courage, tolerance, and human rights. Devotees remember his teachings through prayers and reflections. It reinforces the values of justice and sacrifice. {The date varies as it is based on the Sikh lunar calendar.}",
          "category": "India"
        },
        {
          "title": "World Conjoined Twins Day",
          "description": "World Conjoined Twins Day raises awareness about conjoined twins and their unique challenges. It promotes understanding, inclusion, and medical research. The day highlights the strength and resilience of individuals and families. Awareness campaigns focus on dignity and social acceptance. It encourages compassion and scientific advancement.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 25,
      "events": [
        {
          "title": "International Day for the Elimination of Violence against Women",
          "description": "This day raises awareness about violence against women worldwide. It was established by the United Nations to promote gender equality and safety. Governments and organizations run campaigns and advocacy programs. The observance supports survivors and calls for stronger laws. It emphasizes zero tolerance for gender-based violence.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 26,
      "events": [
        {
          "title": "World Sustainable Transport Day",
          "description": "World Sustainable Transport Day promotes eco-friendly and accessible transportation systems. It highlights the role of transport in reducing emissions and improving quality of life. The United Nations encourages innovation and policy reforms. Discussions focus on public transport and clean energy. The day supports sustainable development goals.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 29,
      "events": [
        {
          "title": "International Day of Solidarity with the Palestinian People",
          "description": "This day highlights the rights and struggles of the Palestinian people. It was established by the United Nations to promote peace and justice. Educational programs and discussions are organized worldwide. The observance encourages dialogue and international cooperation. It emphasizes respect for human rights.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 30,
      "events": [
        {
          "title": "Day of Remembrance for all Victims of Chemical Warfare",
          "description": "This day honors victims of chemical weapons use across history. It raises awareness about the dangers of chemical warfare. The United Nations promotes disarmament and non-proliferation. Educational initiatives emphasize peace and accountability. The day supports global security efforts.",
          "category": "Worldwide"
        }
      ]
    }
  ],
  "dec": [
    {
      "date": 1,
      "events": [
        {
          "title": "World AIDS Day",
          "description": "World AIDS Day raises awareness about HIV/AIDS and supports those affected. It promotes prevention, treatment, and ending stigma. Governments and organizations conduct health campaigns worldwide. The red ribbon symbolizes solidarity and hope. The day encourages global action toward ending AIDS.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 2,
      "events": [
        {
          "title": "International Day for the Abolition of Slavery",
          "description": "This day highlights the ongoing fight against modern slavery and human trafficking. It commemorates the adoption of the UN convention against exploitation. Awareness programs focus on forced labor and child slavery. The observance supports human dignity and justice. It calls for stronger international action.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 3,
      "events": [
        {
          "title": "International Day of Persons with Disabilities",
          "description": "This day promotes the rights and well-being of persons with disabilities. It encourages inclusion and accessibility in all areas of life. Governments and organizations raise awareness through campaigns and events. The observance supports equal opportunities. It emphasizes respect and empowerment.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 4,
      "events": [
        {
          "title": "International Day of Banks",
          "description": "International Day of Banks recognizes the role of banks in sustainable development. It highlights financial inclusion and economic stability. The United Nations promotes responsible banking practices. Discussions focus on innovation and resilience. The day supports global economic growth.",
          "category": "Worldwide"
        },
        {
          "title": "International Day against Unilateral Coercive Measures",
          "description": "This day raises awareness about the impact of unilateral sanctions on nations and civilians. It promotes dialogue and international cooperation. The United Nations highlights humanitarian consequences. Discussions focus on fairness and global justice. The day encourages peaceful conflict resolution.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 5,
      "events": [
        {
          "title": "World Soil Day [FAO]",
          "description": "World Soil Day highlights the importance of healthy soil for food security and ecosystems. It is led by the Food and Agriculture Organization. Awareness programs promote sustainable soil management. The day emphasizes conservation and climate resilience. It supports sustainable agriculture worldwide.",
          "category": "Worldwide"
        },
        {
          "title": "International Volunteer Day for Economic and Social Development",
          "description": "This day celebrates volunteers and their contribution to development. It was established by the United Nations to promote volunteerism. Organizations recognize community service worldwide. The observance highlights social responsibility. It encourages active citizenship and solidarity.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 7,
      "events": [
        {
          "title": "International Civil Aviation Day",
          "description": "International Civil Aviation Day recognizes the importance of global air transport. It highlights aviation’s role in connectivity and economic growth. The International Civil Aviation Organization promotes safe and sustainable aviation. Discussions focus on innovation and cooperation. The day supports global mobility.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 9,
      "events": [
        {
          "title": "International Anti-Corruption Day",
          "description": "This day raises awareness about corruption and its harmful effects. It was established by the United Nations to promote transparency. Governments and organizations encourage ethical governance. Campaigns focus on accountability and justice. The day supports fair and inclusive societies.",
          "category": "Worldwide"
        },
        {
          "title": "International Day of Commemoration and Dignity of the Victims of the Crime of Genocide and of the Prevention of this Crime",
          "description": "This day honors the memory and dignity of all victims of genocide across history. It was proclaimed by the United Nations to raise awareness about the causes and consequences of genocide. The observance emphasizes the responsibility of the international community to prevent such crimes. Educational programs and remembrance events are held to promote tolerance and human rights. The day serves as a reminder that early action and global cooperation are essential to prevent genocide.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 10,
      "events": [
        {
          "title": "Human Rights Day",
          "description": "Human Rights Day marks the adoption of the Universal Declaration of Human Rights by the United Nations in 1948. It highlights fundamental freedoms and dignity for all people. Governments, organizations, and institutions conduct awareness programs and discussions. The day promotes equality, justice, and respect. It reminds the world of shared responsibility in protecting human rights.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 11,
      "events": [
        {
          "title": "International Mountain Day",
          "description": "International Mountain Day raises awareness about the importance of mountains to ecosystems and livelihoods. It highlights the challenges faced by mountain communities. The United Nations promotes sustainable mountain development through this observance. Educational activities focus on conservation and climate impact. The day emphasizes protecting fragile mountain environments.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 12,
      "events": [
        {
          "title": "International Day of Neutrality",
          "description": "This day recognizes neutrality as a principle that promotes peace and diplomacy. It was established by the United Nations to encourage dialogue over conflict. The observance highlights peaceful conflict resolution methods. Discussions focus on international cooperation. The day supports stability and mutual respect among nations.",
          "category": "Worldwide"
        },
        {
          "title": "International Universal Health Coverage Day",
          "description": "This day promotes access to quality healthcare without financial hardship. It highlights the importance of strong and inclusive health systems. Governments and health organizations advocate policy reforms. Awareness campaigns emphasize equity in healthcare. The day supports global health and well-being goals.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 14,
      "events": [
        {
          "title": "International Day against Colonialism in All its Forms and Manifestations",
          "description": "This day condemns colonialism and its lasting impacts. It promotes self-determination and equality among nations. The United Nations highlights historical injustices and modern consequences. Educational programs encourage awareness and dialogue. The observance supports global justice and human dignity.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 18,
      "events": [
        {
          "title": "International Migrants Day",
          "description": "International Migrants Day recognizes the contributions of migrants worldwide. It highlights challenges such as displacement and discrimination. The United Nations promotes migrant rights and inclusion. Awareness campaigns encourage compassion and fair policies. The day supports safe and orderly migration.",
          "category": "Worldwide"
        },
        {
          "title": "Arabic Language Day",
          "description": "Arabic Language Day celebrates the Arabic language and its cultural heritage. It highlights Arabic’s contribution to literature, science, and philosophy. The United Nations promotes multilingualism through this observance. Educational events and cultural programs are organized worldwide. The day supports linguistic diversity.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 20,
      "events": [
        {
          "title": "International Human Solidarity Day",
          "description": "This day emphasizes unity and collective responsibility. It highlights solidarity as a core value for global cooperation. The United Nations encourages action against poverty and inequality. Awareness programs promote shared goals and empathy. The observance supports peace and sustainable development.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 21,
      "events": [
        {
          "title": "World Basketball Day",
          "description": "World Basketball Day celebrates the global impact of basketball as a sport. It highlights teamwork, inclusion, and cultural exchange. The United Nations recognizes basketball’s role in youth engagement and peace-building. Events and games are organized worldwide. The day promotes sportsmanship and unity.",
          "category": "Worldwide"
        },
        {
          "title": "World Meditation Day",
          "description": "World Meditation Day highlights the importance of mental well-being, inner peace, and mindfulness in daily life. It encourages people to practice meditation as a tool to reduce stress and improve emotional health. The day promotes awareness of mental balance in a fast-paced world. Governments, wellness organizations, and individuals take part through guided sessions and educational programs. It emphasizes the role of meditation in building compassion and clarity.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 23,
      "events": [
        {
          "title": "Hazarat Ali's Birthday",
          "description": "Hazarat Ali’s Birthday commemorates the birth of Imam Ali ibn Abi Talib, the cousin and son-in-law of Prophet Muhammad. He is respected for his wisdom, courage, and contributions to Islamic teachings. Devotees observe the day with prayers, sermons, and acts of charity. The occasion emphasizes justice, humility, and moral leadership. It holds deep spiritual significance in the Islamic faith. (The date varies each year as it is based on the Islamic lunar calendar.)",
          "category": "India"
        }
      ]
    },
    {
      "date": 24,
      "events": [
        {
          "title": "International Anti-Cybercrime Day",
          "description": "International Anti-Cybercrime Day raises awareness about the growing threat of cybercrime in the digital age. It highlights issues such as online fraud, identity theft, and cyber terrorism. The day encourages governments and organizations to strengthen cybersecurity measures. Educational programs promote safe and responsible internet use. It supports global cooperation to combat cyber-related crimes.",
          "category": "Worldwide"
        },
        {
          "title": "Christmas Eve",
          "description": "Christmas Eve marks the evening before the birth of Jesus Christ and is observed by Christians worldwide. It is a time of reflection, prayer, and family gatherings. Many attend midnight church services and participate in candlelight prayers. Traditions include decorating homes and preparing festive meals. The day symbolizes hope, peace, and anticipation.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 25,
      "events": [
        {
          "title": "Christmas Day",
          "description": "Christmas Day celebrates the birth of Jesus Christ, a central figure in Christianity. It is a major religious and cultural festival observed across the world. People attend church services, exchange gifts, and share festive meals. The day promotes values of love, generosity, and compassion. It brings families and communities together in celebration.",
          "category": "Worldwide"
        }
      ]
    },
    {
      "date": 27,
      "events": [
        {
          "title": "International Day of Epidemic Preparedness",
          "description": "International Day of Epidemic Preparedness emphasizes the importance of readiness to prevent and respond to disease outbreaks. It was established by the United Nations to promote global cooperation in public health. The day highlights lessons learned from past epidemics and pandemics. Governments and health organizations focus on strengthening healthcare systems. It encourages early action and global solidarity to protect lives.",
          "category": "Worldwide"
        }
      ]
    }
  ]
}